[
  {
    "title": "A crypto investor is charged with kidnapping and torturing a man in an NYC apartment for weeks",
    "description": "NEW YORK (AP) — A cryptocurrency investor has been arrested and charged with kidnapping a man and keeping him locked up for weeks in an upscale Manhattan apartment, where authorities say he was beaten, shocked and led to believe that his family was in danger if he didn&#8217;t give up his Bitcoin password. John Woeltz, [&#8230;]",
    "url": "https://www.mymotherlode.com/news/national/3922419/a-crypto-investor-is-charged-with-kidnapping-and-torturing-a-man-in-an-nyc-apartment-for-weeks.html",
    "source": {
      "name": "mymotherlode"
    },
    "published_at": "2025-05-25T04:01:17+00:00"
  },
  {
    "title": "Crypto Investor Charged With Kidnapping and Torturing Man for Weeks",
    "description": "The investor, 37-year-old John Woeltz, and another man abused their victim for three weeks in a Manhattan townhouse as they tried to get his Bitcoin password, prosecutors say.",
    "url": "https://www.nytimes.com/2025/05/24/nyregion/crypto-investor-torture-italian-tourist.html",
    "source": {
      "name": "The New York Times"
    },
    "published_at": "2025-05-24T21:04:19+00:00"
  },
  {
    "title": "Accused crypto-kidnapper held without bail during Saturday court appearance",
    "description": "Kentucky-based cryptocurrency investor, John Woeltz, is accused of kidnapping and torturing an Italian businessman in a sadistic attempt to extort his Bitcoin password was ordered held without bail Saturday by a Manhattan judge.",
    "url": "https://nypost.com/2025/05/24/world-news/accused-crypto-kidnapper-held-without-bail-during-saturday-court-appearance/",
    "source": {
      "name": "Post"
    },
    "published_at": "2025-05-24T16:18:20+00:00"
  },
  {
    "title": "Crypto King Bitcoin Breaks Barriers as Investor Confidence Fuels Rally",
    "description": "A Historic Surge for Bitcoin A surge in enthusiasm on Bitcoin Pizza Day, where BTC surged past $111,800, cheered everyone. Cryptocurrency besting its all-time high reflects the positive momentum of investors brought about by institutional adoption and regulatory support instead of the negative side as history says about that time of the year. Regulatory Clarity [&#8230;]The post Crypto King Bitcoin Breaks Barriers as Investor Confidence Fuels Rally appeared first on ABC Money.",
    "url": "https://www.abcmoney.co.uk/2025/05/crypto-king-bitcoin-breaks-barriers-as-investor-confidence-fuels-rally/",
    "source": {
      "name": "ABC Money"
    },
    "published_at": "2025-05-24T07:05:10+00:00"
  },
  {
    "title": "Crypto Liquidation Hit $542 Million Amid Bitcoin-Fueled Market Bloodbath",
    "description": "Crypto Liquidation Hit $542 Million Amid Bitcoin-Fueled Market Bloodbath",
    "url": "https://www.investing.com/news/cryptocurrency-news/crypto-liquidation-hit-542-million-amid-bitcoinfueled-market-bloodbath-4062520",
    "source": {
      "name": "Investing.com | Stock Market Quotes &amp; Financial News"
    },
    "published_at": "2025-05-23T20:30:18+00:00"
  },
  {
    "title": "Washington State Tightens Oversight on Crypto Kiosks",
    "description": "Washington State is strengthening its regulations for the growing and sometimes disputed field of cryptocurrency kiosks. You may also know them as Bitcoin ATMs, and today, you will often see them at gas stations, convenience stores, or in urban neighborhoods for the quick purchase or selling of digital currencies.&#160; Yet because it is very easy [&#8230;]",
    "url": "https://washingtoncitypaper.com/article/764591/washington-state-tightens-oversight-on-crypto-kiosks/",
    "source": {
      "name": "washingtoncitypaper"
    },
    "published_at": "2025-05-23T13:29:02+00:00"
  },
  {
    "title": "The Ultimate Bitcoin Mining Guide: Top 5 Best Cloud Mining Sites for Beginners in 2025, Low Cost, High Returns – Start Your Crypto Mining Journey with Ease",
    "description": "In 2025, cryptocurrency mining remains one of the most popular ways for individuals to earn passive income and grow their digital asset portfolios. However, the high cost of mining hardware, electricity fees, and technical know-how often create barriers for beginners. Thankfully, the rise of cloud mining has made it possible for anyone—even without owning mining [&#8230;]The post The Ultimate Bitcoin Mining Guide: Top 5 Best Cloud Mining Sites for Beginners in 2025, Low Cost, High Returns – Start Your Crypto Mining Journey with Ease appeared first on ABC Money.",
    "url": "https://www.abcmoney.co.uk/2025/05/the-ultimate-bitcoin-mining-guide-top-5-best-cloud-mining-sites-for-beginners-in-2025",
    "source": {
      "name": "ABC Money"
    },
    "published_at": "2025-05-23T13:00:13+00:00"
  },
  {
    "title": "Bitcoin hits a record high of $110,000, BTC whales use PaladinMining to bid farewell to traditional hardware mining and earn $3,000 a day",
    "description": "As the price of Bitcoin breaks through the historic $110,000 mark, a mining revolution led by crypto whales is quietly emerging – through PaladinMining’s innovative cloud computing platform, senior investors are earning four-digit US dollar returns every day with zero hardware investment This article will explore the difference between traditional hardware mining and cloud mining [&#8230;]",
    "url": "https://cyprus-mail.com/2025/05/23/bitcoin-hits-a-record-high-of-110000-btc-whales-use-paladinmining-to-bid-farewell-to-traditional-hardware-mining-and-earn-3000-a-day",
    "source": {
      "name": "cyprus-mail"
    },
    "published_at": "2025-05-23T12:40:00+00:00"
  },
  {
    "title": "Microsoft's crypto payment gateway, bridging traditional and digital finance",
    "description": "Now that digital currencies are becoming more popular, Microsoft has introduced its Crypto Payment Gateway. It was created to let merchants use crypto while benefiting from the protection, stability, and ease of use that standard finance offers. The gateway connects decentralized finance with advanced enterprise systems, showing how businesses and consumers are starting to transact online differently. The more digital currencies are used online, the more interest is growing in the shiba inu coin and alternative crypto coins to Bitcoin and Ethereum. If this payment gateway is adopted, people may...",
    "url": "https://betanews.com/2025/05/23/microsofts-crypto-payment-gateway-bridging-traditional-and-digital-finance/",
    "source": {
      "name": "betanews"
    },
    "published_at": "2025-05-23T17:50:21+00:00"
  },
  {
    "title": "$670M in Bitcoin Moved to Major U.S. Crypto Exchange In Mere Hours",
    "description": "$670M in Bitcoin Moved to Major U.S. Crypto Exchange In Mere Hours",
    "url": "https://www.investing.com/news/cryptocurrency-news/670m-in-bitcoin-moved-to-major-us-crypto-exchange-in-mere-hours-4061154",
    "source": {
      "name": "Investing.com | Stock Market Quotes &amp; Financial News"
    },
    "published_at": "2025-05-23T03:00:15+00:00"
  },
  {
    "title": "Ethereum Eyes Gains as It Trails Bitcoin’s Rally",
    "description": "Bitcoin really stood dominant in the past 6 months while Ethereum was lagging against other cryptocurrencies such as Solana and XRP. Is Ether going to play catch-up? An in-depth technical analysis is due for the second biggest crypto. ETH Revisits levels last seen in February 2025 around the $2600 mark. An Overview on the Cryptocurrencies [&#8230;]The post Ethereum Eyes Gains as It Trails Bitcoin&#8217;s Rally appeared first on Action Forex.",
    "url": "https://www.actionforex.com/contributors/technical-analysis/598070-ethereum-eyes-gains-as-it-trails-bitcoins-rally/",
    "source": {
      "name": "actionforex"
    },
    "published_at": "2025-05-23T02:21:36+00:00"
  },
  {
    "title": "Billion dollar pizza? Bitcoin soars on key anniversary of crypto’s growth",
    "description": "It&#8217;s not an official holiday &#8212; yet &#8212; but for many cryptocurrency enthusiasts &#8220;Bitcoin Pizza Day&#8221; is still special. Thursday marks the 15th anniversary of the first known use of cryptocurrency to buy real-world goods. The 10,000 bitcoin that software developer Laszlo Hanyecz paid for two Papa John&#8217;s pizzas delivered to his Florida home on [&#8230;]",
    "url": "https://financialpost.com/pmn/billion-dollar-pizza-bitcoin-soars-on-key-anniversary-of-cryptos-growth",
    "source": {
      "name": "Financial Post | Canada Business News"
    },
    "published_at": "2025-05-22T17:20:12+00:00"
  },
  {
    "title": "Crypto industry leaders fear Trump’s putting personal profits first",
    "description": "It seems like a triumph for a cryptocurrency industry that has long sought mainstream acceptance: Top investors in one of President Donald Trump &#8216;s crypto projects invited to dine with him at his luxury golf club in Northern Virginia on the heels of the Senate advancing key pro-crypto legislation and while bitcoin prices soar. But [&#8230;]The post Crypto industry leaders fear Trump’s putting personal profits first appeared first on MACAU DAILY TIMES 澳門每日時報.",
    "url": "https://macaudailytimes.com.mo/crypto-industry-leaders-fear-trumps-putting-personal-profits-first.html",
    "source": {
      "name": "macaudailytimes"
    },
    "published_at": "2025-05-23T00:06:31+00:00"
  },
  {
    "title": "Billion dollar pizza? Bitcoin soars on key anniversary of crypto's growth",
    "description": "It’s not an official holiday – yet – but for many cryptocurrency enthusiasts “Bitcoin Pizza Day” is still special",
    "url": "https://www.marketbeat.com/articles/billion-dollar-pizza-bitcoin-soars-on-key-anniversary-of-cryptos-growth-2025-05-22/",
    "source": {
      "name": "lulegacy"
    },
    "published_at": "2025-05-22T17:17:21+00:00"
  },
  {
    "title": "Breaking: Bitcoin Pizza Day Celebrates Crypto’s Historic Moment",
    "description": "Bitcoin Pizza Day marks Bitcoin's first real-world purchase, turning two pizzas into crypto legend—celebrating innovation, community, and blockchain's journey.",
    "url": "https://www.forbes.com/sites/digital-assets/2025/05/22/breaking--bitcoin-pizza-day-celebrates-cryptos-historic-moment/",
    "source": {
      "name": "Forbes"
    },
    "published_at": "2025-05-22T19:57:28+00:00"
  },
  {
    "title": "The crypto industry saw Trump as a champion. Some now fear he’s putting personal profits first",
    "description": "WASHINGTON (AP) — It seems like a triumph for a cryptocurrency industry that has long sought mainstream acceptance: Top investors in one of President Donald Trump ’s crypto projects invited to dine with him at his luxury golf club in Northern Virginia on the heels of the Senate advancing key pro-crypto legislation and while bitcoin [&#8230;]",
    "url": "https://www.mymotherlode.com/news/national/us-government/3911114/the-crypto-industry-saw-trump-as-a-champion-some-now-fear-hes-putting-personal-profits-first.html",
    "source": {
      "name": "mymotherlode"
    },
    "published_at": "2025-05-22T05:14:02+00:00"
  },
  {
    "title": "Bitcoin Races Towards New All-Time Highs – Crypto Update",
    "description": "BTC is less than $1,000 from its all-time highs! Bitcoin and other cryptos appreciated quite well since April 2025, from a rebound in risk assets. Fears from US tariffs were at their peak as President Trump started to put down the microphone and discuss with other foreign politicians. The US dollar as been lagging, giving [&#8230;]The post Bitcoin Races Towards New All-Time Highs &#8211; Crypto Update appeared first on Action Forex.",
    "url": "https://www.actionforex.com/contributors/fundamental-analysis/597920-bitcoin-races-towards-new-all-time-highs-crypto-update/",
    "source": {
      "name": "actionforex"
    },
    "published_at": "2025-05-22T02:31:43+00:00"
  },
  {
    "title": "The crypto industry saw Trump as a champion. Some now fear he's putting personal profits first",
    "description": "It seems like a triumph for a cryptocurrency industry that’s sought mainstream acceptance: Top investors in one of President Donald Trump’s crypto projects invited to dine with him at his luxury golf club in Northern Virginia on the heels of the Senate advancing key pro-crypto legislation and while bitcoin prices soar",
    "url": "https://www.marketbeat.com/articles/the-crypto-industry-saw-trump-as-a-champion-some-now-fear-hes-putting-personal-profits-first-2025-05-22/",
    "source": {
      "name": "lulegacy"
    },
    "published_at": "2025-05-22T05:11:25+00:00"
  },
  {
    "title": "Bitcoin hits all-time high amid ‘price explosion’",
    "description": "Record-breaking rally sees crypto analysts revise price predictions for 2025",
    "url": "https://www.independent.co.uk/tech/bitcoin-price-record-crypto-prediction-2025-b2755799.html",
    "source": {
      "name": "independent"
    },
    "published_at": "2025-05-22T08:15:21+00:00"
  },
  {
    "title": "Bitcoin hits new price highs as crypto industry scores wins",
    "description": "Bitcoin hit a new all-time high as the world&#8217;s most popular cryptocurrency reached price levels not seen since President Donald Trump&#8217;s inauguration. The digital asset traded above $109,400 Wednesday morning, a huge increase from recent lows of about $75,000 last month. Several other cryptocurrencies have seen similar large gains in recent days. That includes Trump&#8217;s [&#8230;]",
    "url": "https://financialpost.com/pmn/bitcoin-hits-new-price-highs-as-crypto-industry-scores-wins",
    "source": {
      "name": "business"
    },
    "published_at": "2025-05-21T15:48:36+00:00"
  },
  {
    "title": "Bitcoin Hits Record High Amid U.S. Crypto Policy Speculation",
    "description": "FAMAGUSTA GAZETTE &#8211; Bitcoin surged to an all-time high on Wednesday, trading at just over $109,000 in the afternoon. The&#8230;",
    "url": "https://famagusta-gazette.com/bitcoin-hits-record-high-amid-u-s-crypto-policy-speculation/",
    "source": {
      "name": "famagusta-gazette"
    },
    "published_at": "2025-05-21T19:34:41+00:00"
  },
  {
    "title": "Strategies for college students to enhance financial flexibility",
    "description": "College life presents a myriad of financial challenges, from tuition fees to daily expenses. As students seek innovative ways to manage their finances, cryptocurrency emerges as a compelling option. Understanding how to integrate crypto into your budget can offer both flexibility and financial growth. In this context, exploring how to buy bitcoin in CAD can be a...The post Strategies for college students to enhance financial flexibility appeared first on The Rocky Mountain Collegian.",
    "url": "https://collegian.com/sponsored/2025/05/strategies-for-college-students-to-enhance-financial-flexibility/",
    "source": {
      "name": "collegian"
    },
    "published_at": "2025-05-21T15:30:30+00:00"
  },
  {
    "title": "Bitcoin Hits All-Time High Of Over $109K Amid Crypto Rally",
    "description": "The Senate advanced regulations for stablecoins earlier this week, following support from the broader crypto industry.",
    "url": "https://www.forbes.com/sites/tylerroush/2025/05/21/bitcoin-hits-all-time-high-of-over-109k-amid-crypto-rally/",
    "source": {
      "name": "Forbes"
    },
    "published_at": "2025-05-21T15:45:04+00:00"
  },
  {
    "title": "Bitcoin hits new price highs as crypto industry scores wins",
    "description": "Bitcoin hit a new all-time high as the world’s most popular cryptocurrency reached price levels not seen since President Donald Trump’s inauguration",
    "url": "https://www.marketbeat.com/articles/bitcoin-hits-new-price-highs-as-crypto-industry-scores-wins-2025-05-21/",
    "source": {
      "name": "lulegacy"
    },
    "published_at": "2025-05-21T15:45:14+00:00"
  },
  {
    "title": "Bitcoin hits new price highs as crypto industry scores wins",
    "description": "By Alan Suderman Bitcoin hit a new all-time high as the world&#8217;s most popular cryptocurrency reached price levels not seen since President Donald Trump&#8217;s inauguration. The digital asset traded above $109,400 Wednesday morning, a huge increase from recent lows of about $75,000 last month. Several other cryptocurrencies have seen similar large gains in recent days. [&#8230;]",
    "url": "https://winnipegsun.com/pmn/bitcoin-hits-new-price-highs-as-crypto-industry-scores-wins",
    "source": {
      "name": "winnipegsun"
    },
    "published_at": "2025-05-21T15:48:42+00:00"
  },
  {
    "title": "Bitcoin hits new price highs as crypto industry scores wins",
    "description": "Bitcoin hit a new all-time high as the world’s most popular cryptocurrency reached price levels not seen since President Donald Trump’s inauguration. The digital asset traded above $109,400 Wednesday morning, a huge increase from recent lows of about $75,000 last month. Several other cryptocurrencies have seen similar large gains in recent days. That includes Trump’s official meme coins, which have jumped up about 75% in the last month. Bitcoin’s price increase comes after the crypto industry scored a major win with the U.S. Senate advancing legislation that creates a federal framework...",
    "url": "https://www.mymotherlode.com/news/national/3908272/bitcoin-hits-new-price-highs-as-crypto-industry-scores-wins.html",
    "source": {
      "name": "mymotherlode"
    },
    "published_at": "2025-05-21T16:04:14+00:00"
  },
  {
    "title": "Best free Crypto mining apps for iOS and Android in 2025: Easily earn passive income with mobile bitcoin mining",
    "description": "With crypto adoption going mainstream in 2025, earning digital assets passively is easier than ever — right from your smartphone. Whether you’re using iOS or Android, the market is full of free crypto mining apps that let you start Bitcoin mining on your phone with no technical expertise. In this guide, we’ll explore the top [&#8230;]",
    "url": "https://cyprus-mail.com/2025/05/20/best-free-crypto-mining-apps-for-ios-and-android-in-2025-easily-earn-passive-income-with-mobile-bitcoin-mining",
    "source": {
      "name": "cyprus-mail"
    },
    "published_at": "2025-05-20T13:00:00+00:00"
  },
  {
    "title": "Trump has sent bitcoin soaring. Is it the right time to invest?",
    "description": "Driving bitcoin’s recent rally to over $150,000 could be anticipation of an upcoming dinner between Trump and various crypto bigwigs.",
    "url": "https://www.watoday.com.au/money/investing/trump-has-sent-bitcoin-soaring-is-it-the-right-time-to-invest-20250520-p5m0qu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "source": {
      "name": "watoday"
    },
    "published_at": "2025-05-20T19:01:00+00:00"
  },
  {
    "title": "Cryptocurrency Stocks To Watch Now – May 18th",
    "description": "Robinhood Markets, Bitdeer Technologies Group, and HIVE Digital Technologies are the three Cryptocurrency stocks to watch today, according to MarketBeat&#8217;s stock screener tool. Cryptocurrency stocks are shares of publicly traded companies whose core business involves digital currencies—whether through mining operations, crypto exchanges, blockchain technology development, or large-scale corporate investment in tokens like Bitcoin. By buying [&#8230;]",
    "url": "https://www.etfdailynews.com/2025/05/21/cryptocurrency-stocks-to-watch-now-may-18th/",
    "source": {
      "name": "etfdailynews"
    },
    "published_at": "2025-05-21T08:08:53+00:00"
  },
  {
    "title": "Promising Bitcoin Stocks To Consider – May 18th",
    "description": "iShares Bitcoin Trust, MARA, and Riot Platforms are the three Bitcoin stocks to watch today, according to MarketBeat&#8217;s stock screener tool. Bitcoin stocks are shares of publicly traded companies whose business operations or balance sheets are tied to Bitcoin. This can include Bitcoin miners, technology firms building blockchain infrastructure, crypto exchanges, or corporations holding substantial [&#8230;]",
    "url": "https://www.etfdailynews.com/2025/05/21/promising-bitcoin-stocks-to-consider-may-18th/",
    "source": {
      "name": "etfdailynews"
    },
    "published_at": "2025-05-21T08:08:53+00:00"
  },
  {
    "title": "Big Crypto Fraud: ‘We are no experts,’ Supreme Court orders probe into cryptocurrencies, says banning not a viable option",
    "description": "Crypto Fraud News Update: In a significant development in cryptocurrencies, the Supreme Court has emphasised the need to regulate such currencies, stating that imposition restrictions on such securities is not an option. Ordering an expert probe into the subject, the apex court also said that it is essential that strong measures be taken to enhance surveillance in this regard. Read on to learn more about what the country’s top court said on cryptocurrencies such as Bitcoin.",
    "url": "https://www.zeebiz.com/markets/currency/news-big-crypto-fraud-we-are-no-experts-supreme-court-orders-probe-into-cryptocurrencies-says-banning-not-a-viable-option-363301",
    "source": {
      "name": "Zee Business"
    },
    "published_at": "2025-05-20T13:19:20+00:00"
  },
  {
    "title": "Trump has sent bitcoin soaring. Is it the right time to invest?",
    "description": "Driving bitcoin’s recent rally to over $150,000 could be anticipation of an upcoming dinner between Trump and various crypto bigwigs.",
    "url": "https://www.theage.com.au/money/investing/trump-has-sent-bitcoin-soaring-is-it-the-right-time-to-invest-20250520-p5m0qu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "source": {
      "name": "The Age"
    },
    "published_at": "2025-05-20T19:01:00+00:00"
  },
  {
    "title": "Trump has sent bitcoin soaring. Is it the right time to invest?",
    "description": "Driving bitcoin’s recent rally to over $150,000 could be anticipation of an upcoming dinner between Trump and various crypto bigwigs.",
    "url": "https://www.smh.com.au/money/investing/trump-has-sent-bitcoin-soaring-is-it-the-right-time-to-invest-20250520-p5m0qu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "source": {
      "name": "The Sydney Morning Herald"
    },
    "published_at": "2025-05-20T19:01:00+00:00"
  },
  {
    "title": "Ripple CEO Reacts to Major XRP Milestone; Bitcoin Enters ATH Season, Samson Mow Believes; SHIB Team Releases Key Update on Upcoming SHIB L3 Alpha: Crypto News Digest by U.Today",
    "description": "Ripple CEO Reacts to Major XRP Milestone; Bitcoin Enters ATH Season, Samson Mow Believes; SHIB Team Releases Key Update on Upcoming SHIB L3 Alpha: Crypto News Digest by U.Today",
    "url": "https://www.investing.com/news/cryptocurrency-news/ripple-ceo-reacts-to-major-xrp-milestone-bitcoin-enters-ath-season-samson-mow-believes-shib-team-releases-key-update-on-upcoming-shib-l3-alpha-crypto-news-digest-by-utoday-4055966",
    "source": {
      "name": "Investing.com | Stock Market Quotes &amp; Financial News"
    },
    "published_at": "2025-05-20T22:30:17+00:00"
  },
  {
    "title": "The Significance of Jamie Dimon’s Reluctant Bitcoin Surrender",
    "description": "One of Wall Street's biggest crypto skeptics will now allow JPMorgan Chase's clients to buy Bitcoin.",
    "url": "https://time.com/7287164/jpmorgan-chase-bitcoin-jamie-dimon/",
    "source": {
      "name": "TIME.com"
    },
    "published_at": "2025-05-20T18:55:24+00:00"
  },
  {
    "title": "WOO X celebrates Bitcoin Pizza Day with daily BTC prizes",
    "description": "Traders can spin for a chance to win Bitcoin by completing tasks and hitting trading milestones during the 3-day event KINGSTOWN, St. Vincent and the Grenadines , May 20, 2025 (GLOBE NEWSWIRE) &#8212; WOO X, a leading global crypto trading platform, is celebrating Bitcoin Pizza Day with a campaign that literally rewards traders with a [&#8230;]",
    "url": "https://financialpost.com/globe-newswire/woo-x-celebrates-bitcoin-pizza-day-with-daily-btc-prizes",
    "source": {
      "name": "business"
    },
    "published_at": "2025-05-20T09:30:04+00:00"
  },
  {
    "title": "Crypto trades rebound in April, Bitcoin still 66% below peak",
    "description": "Cryptocurrencies saw a significant increase in April&#8217;s trading volume as market sentiment turned bullish following major U.S. policy shifts. President Donald Trump&#8217;s decision to pause new tariffs sparked a rally in risk assets, lifting Bitcoin by 15.5% by the end of the month. Momentum grew further after the U.S. announced the creation of a strategic Bitcoin reserve, signaling stronger institutional backing. According to data presented by CryptoPresales.com, Bitcoin trading volume rebounded to $751.9 bln in April, still 66% below the February peak. Historically, April has been a...",
    "url": "https://www.financialmirror.com/2025/05/19/crypto-trades-rebound-in-april-bitcoin-still-66-below-peak/",
    "source": {
      "name": "financialmirror"
    },
    "published_at": "2025-05-19T09:17:59+00:00"
  },
  {
    "title": "US Senate set to debate crypto bill as bitcoin nears all-time high",
    "description": "",
    "url": "https://www.independent.co.uk/bulletin/news/bitcoin-price-high-us-senate-b2753690.html",
    "source": {
      "name": "Independent"
    },
    "published_at": "2025-05-19T10:51:23+00:00"
  },
  {
    "title": "Crypto elite increasingly worried about their personal safety",
    "description": "Cryptocurrency executives and other investors with significant wealth from crypto holdings are getting more serious about personal security, according to stories this weekend in both the Wall Street Journal and Bloomberg. While cryptocurrencies have always created unique security risks, it seems there’s a rising threat of violent abduction due to the growing value of Bitcoin, [&#8230;]",
    "url": "https://techcrunch.com/2025/05/18/crypto-elite-increasingly-worried-about-their-personal-safety/",
    "source": {
      "name": "TechCrunch"
    },
    "published_at": "2025-05-18T21:31:09+00:00"
  },
  {
    "title": "The Rise of Bitcoin Casino Deposits: A Smarter Way to Gamble or Just a Risky Bet?",
    "description": "Bitcoin casinos show how digital currencies are changing the way people gamble online. The interest in these platforms has grown substantially, showing a clear move in players&#8217; priorities. The benefits make it easy to see why crypto gambling is taking off. These platforms give you better privacy than regular gambling sites that just need tons [&#8230;]The post The Rise of Bitcoin Casino Deposits: A Smarter Way to Gamble or Just a Risky Bet? appeared first on ABC Money.",
    "url": "https://www.abcmoney.co.uk/2025/05/the-rise-of-bitcoin-casino-deposits-a-smarter-way-to-gamble-or-just-a-risky-bet/",
    "source": {
      "name": "ABC Money"
    },
    "published_at": "2025-05-16T07:45:34+00:00"
  },
  {
    "title": "Purpose Investments Expands Canada’s Leading Crypto ETF Lineup With Launch of Core Bitcoin and Ether ETFs",
    "description": "Designed for advisors and investors with a long-term horizon, these two new ETFs offer direct exposure to Bitcoin and Ether through a simplified, cost-efficient structure TORONTO, May 15, 2025 (GLOBE NEWSWIRE) &#8212; Purpose Investments Inc. (“Purpose Investments” or “Purpose”), the pioneer behind the world’s first spot Bitcoin ETF, is strengthening its leadership in crypto investing [&#8230;]",
    "url": "https://financialpost.com/globe-newswire/purpose-investments-expands-canadas-leading-crypto-etf-lineup-with-launch-of-core-bitcoin-and-ether-etfs",
    "source": {
      "name": "Financial Post | Canada Business News"
    },
    "published_at": "2025-05-15T11:33:28+00:00"
  },
  {
    "title": "Altcoins Consolidating Their Strength by Joining Bitcoin",
    "description": "Market Picture Market capitalisation has fallen 2% in the last 24 hours to $3.30 trillion. Bitcoin, stuck near past highs, quickly spoiled the market’s mood, triggering a local profit correction after the rally. An active correction in gold may also be playing a role. The crypto market sentiment index rolled back from 73 to 70, [&#8230;]The post Altcoins Consolidating Their Strength by Joining Bitcoin appeared first on Action Forex.",
    "url": "https://www.actionforex.com/contributors/fundamental-analysis/597145-altcoins-consolidating-their-strength-by-joining-bitcoin/",
    "source": {
      "name": "actionforex"
    },
    "published_at": "2025-05-15T08:53:30+00:00"
  },
  {
    "title": "Bitcoin boosters push to make New Hampshire ‘the granite cradle of crypto’",
    "description": "Top Republicans see crypto as an opportunity to transform the state’s economy.",
    "url": "https://www.nhpr.org/nh-news/2025-05-13/bitcoin-boosters-push-to-make-new-hampshire-the-granite-cradle-of-crypto",
    "source": {
      "name": "nhpr"
    },
    "published_at": "2025-05-13T16:28:45+00:00"
  },
  {
    "title": "Daughter of crypto boss fights off Paris kidnappers",
    "description": "It's the latest in a string of European kidnap attempts by gangs to extort Bitcoin and other tokens.",
    "url": "https://www.watoday.com.au/world/daughter-of-crypto-boss-fights-off-paris-kidnappers-20250514-p5lz06.html?ref=rss&utm_medium=rss&utm_source=rss_world",
    "source": {
      "name": "watoday"
    },
    "published_at": "2025-05-13T22:31:08+00:00"
  },
  {
    "title": "Daughter of crypto boss fights off Paris kidnappers",
    "description": "It's the latest in a string of European kidnap attempts by gangs to extort Bitcoin and other tokens.",
    "url": "https://www.smh.com.au/world/daughter-of-crypto-boss-fights-off-paris-kidnappers-20250514-p5lz06.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "source": {
      "name": "The Sydney Morning Herald"
    },
    "published_at": "2025-05-13T22:31:08+00:00"
  },
  {
    "title": "Daughter of crypto boss fights off Paris kidnappers",
    "description": "It's the latest in a string of European kidnap attempts by gangs to extort Bitcoin and other tokens.",
    "url": "https://www.theage.com.au/world/daughter-of-crypto-boss-fights-off-paris-kidnappers-20250514-p5lz06.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "source": {
      "name": "The Age"
    },
    "published_at": "2025-05-13T22:31:08+00:00"
  },
  {
    "title": "Daughter of crypto boss fights off Paris kidnappers",
    "description": "It's the latest in a string of European kidnap attempts by gangs to extort Bitcoin and other tokens.",
    "url": "https://www.theage.com.au/world/daughter-of-crypto-boss-fights-off-paris-kidnappers-20250514-p5lz06.html?ref=rss&utm_medium=rss&utm_source=rss_world",
    "source": {
      "name": "The Age"
    },
    "published_at": "2025-05-13T22:31:08+00:00"
  },
  {
    "title": "Anthony Scaramucci Says Bitcoin Is Evolving From A Tech Asset To Digital Gold",
    "description": "Anthony Scaramucci believes Bitcoin (CRYPTO: BTC) is in the midst of a structural transformation, from a volatile tech-aligned investment to a maturing global asset more comparable read more",
    "url": "https://www.benzinga.com/markets/cryptocurrency/25/05/45372571/anthony-scaramucci-says-bitcoin-is-evolving-from-a-tech-asset-to-digital-gold",
    "source": {
      "name": "benzinga"
    },
    "published_at": "2025-05-13T11:57:44+00:00"
  },
  {
    "title": "Daughter of crypto boss fights off Paris kidnappers",
    "description": "It's the latest in a string of European kidnap attempts by gangs to extort Bitcoin and other tokens.",
    "url": "https://www.brisbanetimes.com.au/world/daughter-of-crypto-boss-fights-off-paris-kidnappers-20250514-p5lz06.html?ref=rss&utm_medium=rss&utm_source=rss_world",
    "source": {
      "name": "brisbanetimes"
    },
    "published_at": "2025-05-13T22:31:08+00:00"
  },
  {
    "title": "‘Buckle Up’—A Perfect Storm Is Suddenly Headed For The Bitcoin Price And Crypto Market",
    "description": "Marcus pointed to recent regulatory changes that mean Wall Street banks can now custody and offer bitcoin to their customers while “sovereign states and corporations are competi Read Full StoryThe post ‘Buckle Up’—A Perfect Storm Is Suddenly Headed For The Bitcoin Price And Crypto Market appeared first on ForexTV.",
    "url": "https://forextv.com/buckle-up-a-perfect-storm-is-suddenly-headed-for-the-bitcoin-price-and-crypto-market/",
    "source": {
      "name": "forextv"
    },
    "published_at": "2025-05-13T07:01:32+00:00"
  },
  {
    "title": "Crypto Booked Profits Amid General Euphoria",
    "description": "Market Picture The Crypto market cap has fallen 1.7% in the last 24 hours to $3.29 trillion, despite continued positive traction in the equity market. The strengthening dollar on news of tariffs has been a natural drag on cryptos. This is doubly true due to Bitcoin’s proximity to the highs, reinforcing the pull for short-term [&#8230;]The post Crypto Booked Profits Amid General Euphoria appeared first on Action Forex.",
    "url": "https://www.actionforex.com/contributors/fundamental-analysis/596869-crypto-booked-profits-amid-general-euphoria/",
    "source": {
      "name": "actionforex"
    },
    "published_at": "2025-05-13T08:57:03+00:00"
  },
  {
    "title": "Decentralized finance is booming – and so are the security risks. My team surveyed nearly 500 crypto investors and uncovered the most common mistakes",
    "description": "By Mingyi Liu, Georgia Institute of Technology  When the first cryptocurrency, Bitcoin, was proposed in 2008, the goal was simple: to create a digital currency free from banks and governments. Over time, that idea evolved into something much bigger: “decentralized finance,” or “DeFi.” With decentralized finance, people trade, borrow and earn interest on crypto assets [&#8230;]",
    "url": "https://investmacro.com/2025/05/decentralized-finance-is-booming-and-so-are-the-security-risks-my-team-surveyed-nearly-500-crypto-investors-and-uncovered-the-most-common-mistakes/",
    "source": {
      "name": "countingpips"
    },
    "published_at": "2025-05-13T11:25:08+00:00"
  },
  {
    "title": "$52,933,217 Bitcoin Stun Largest US Crypto Exchange",
    "description": "$52,933,217 Bitcoin Stun Largest US Crypto Exchange",
    "url": "https://www.investing.com/news/cryptocurrency-news/52933217-bitcoin-stun-largest-us-crypto-exchange-4039125",
    "source": {
      "name": "Investing.com | Stock Market Quotes &amp; Financial News"
    },
    "published_at": "2025-05-12T13:00:17+00:00"
  },
  {
    "title": "KindlyMD shares skyrocket 600% after merger with Trump crypto advisor David Bailey's bitcoin investment company",
    "description": "High-profile backers include bitcoin pioneers Adam Back, Balaji Srinivasan, Jihan Wu, and Mexican billionaire Ricardo Salinas.",
    "url": "https://www.cnbc.com/2025/05/12/kindlymd-trump-crypto-david-bailey-nakamoto.html",
    "source": {
      "name": "CNBC"
    },
    "published_at": "2025-05-12T13:15:28+00:00"
  },
  {
    "title": "Bitcoin nears record high as analysts tell market to ‘buckle up’",
    "description": "Former PayPal president says ‘buckle up’ for crypto rally",
    "url": "https://www.independent.co.uk/tech/bitcoin-price-record-2025-prediction-b2749250.html",
    "source": {
      "name": "Independent"
    },
    "published_at": "2025-05-12T15:18:02+00:00"
  },
  {
    "title": "Eric Trump's American Bitcoin going public in latest crypto move by president's family",
    "description": "American Bitcoin, a Trump Family-backed bitcoin mining company, will go public on the Nasdaq through an all-stock merger with Gryphon Digital Mining.",
    "url": "https://www.cnbc.com/2025/05/12/eric-trump-american-bitcoin-public.html",
    "source": {
      "name": "CNBC"
    },
    "published_at": "2025-05-12T14:30:45+00:00"
  },
  {
    "title": "Best Bitcoin Casino Sites: Top Crypto Gambling Options",
    "description": "Published in cooperation between Levitated Media and the Gilroy Dispatch Bitcoin casinos have quickly gained popularity among online gamblers thanks to their speed, privacy and flexibility. Unlike traditional gambling sites that rely on banks or credit cards, these platforms use Bitcoin and other cryptocurrencies for deposits, wagers and withdrawals. This allows for faster transactions, greater [&#8230;]",
    "url": "https://gilroydispatch.com/best-bitcoin-casino-sites/",
    "source": {
      "name": "gilroydispatch"
    },
    "published_at": "2025-05-12T20:38:42+00:00"
  },
  {
    "title": "Has Bitcoin Dominance Topped? Here Are The Best Cryptos To Buy Now Before Altcoin Season",
    "description": "Has Bitcoin Dominance Topped? Here Are The Best Cryptos To Buy Now Before Altcoin Season",
    "url": "https://www.investing.com/news/press-releases/has-bitcoin-dominance-topped-here-are-the-best-cryptos-to-buy-now-before-altcoin-season-4037676",
    "source": {
      "name": "Investing.com | Stock Market Quotes &amp; Financial News"
    },
    "published_at": "2025-05-10T04:00:49+00:00"
  },
  {
    "title": "Bitcoin’s spiritual home: Italian village stakes its claim on the crypto map",
    "description": "Fornelli, a barely visible dot on the map of Italy, lies in the heart of Molise, within the province of [&#8230;]",
    "url": "https://euroweeklynews.com/2025/05/09/bitcoins-spiritual-home-italian-village-stakes-its-claim-on-the-crypto-map/",
    "source": {
      "name": "euroweeklynews"
    },
    "published_at": "2025-05-09T16:18:26+00:00"
  },
  {
    "title": "Speed Cameras on Bridges and Tunnels; Trump's Embrace of Crypto; Mother's Day Gifts?",
    "description": "On today's show:Jon Campbell, Albany reporter for WNYC and Gothamist, talks about a deal that will allow the MTA to install speed cameras on bridges and tunnels in the city, plus more on how the new budget might affect Gov. Hochul's reelection campaign next year.In president Trump's first administration, he stated that Bitcoin and other cryptocurrencies are \"not money\". Now, his sons head their own crypto company. David Yaffe-Bellany, technology reporter for The New York Times, covering the crypto industry, shares his reporting on the ways the Trump family has financially benefitted from...",
    "url": "http://www.wnyc.org/story/the-brian-lehrer-show-2025-05-09/",
    "source": {
      "name": "wnyc"
    },
    "published_at": "2025-05-09T12:03:10+00:00"
  },
  {
    "title": "Defragmenting blockchain is indispensable for mass adoption: Apex Fusion",
    "description": "Forget the crypto wars where Bitcoin, Ethereum, and Cardano slug it out like barroom brawlers. The problem with the thousands [&#8230;]",
    "url": "https://euroweeklynews.com/2025/05/09/defragmenting-blockchain-is-indispensable-for-mass-adoption-apex-fusion/",
    "source": {
      "name": "euroweeklynews"
    },
    "published_at": "2025-05-09T00:36:09+00:00"
  },
  {
    "title": "Coinbase (Nasdaq: COIN) Earnings Live: Coinbase Q1 in Focus",
    "description": "Coinbase (Nasdaq: COIN) enters earnings day riding high on a wave of crypto optimism — but also facing elevated expectations. The company has been a major beneficiary of resurgent crypto asset prices, a flood of spot Bitcoin ETF inflows, and a friendlier regulatory tone out of Washington. At the same time, increased scrutiny from institutions, shifting [&#8230;]The post Coinbase (Nasdaq: COIN) Earnings Live: Coinbase Q1 in Focus appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2025/05/08/coinbase-nasdaq-coin-earnings-live-coinbase-q1-in-focus/",
    "source": {
      "name": "247wallst"
    },
    "published_at": "2025-05-08T14:09:19+00:00"
  },
  {
    "title": "‘Like being tortured’: Texas residents living next to bitcoin mine are getting sick and being ignored",
    "description": "Republican Governor Greg Abbott said Texas “wears the crown as the bitcoin mining capital of the world.” But in small towns like Granbury, working-class residents living next to giant data centers are the ones paying the price for Texas’s crypto boom.",
    "url": "https://therealnews.com/like-being-tortured-texas-residents-living-next-to-bitcoin-mine-are-getting-sick-and-being-ignored",
    "source": {
      "name": "therealnews"
    },
    "published_at": "2025-05-07T16:18:25+00:00"
  },
  {
    "title": "Trump crypto advisor David Bailey launching $300 million bitcoin investment company",
    "description": "David Bailey, CEO of BTC Inc. and a Trump crypto advisor, has raised $300 million to launch a publicly traded bitcoin investment company.",
    "url": "https://www.cnbc.com/2025/05/07/trump-crypto-advisor-david-bailey-300-million-bitcoin-investment-co.html",
    "source": {
      "name": "CNBC"
    },
    "published_at": "2025-05-07T23:34:56+00:00"
  },
  {
    "title": "Bitcoin Gobbles 65% of Crypto Market – Will Altcoins Bounce Back?",
    "description": "Bitcoin Gobbles 65% of Crypto Market – Will Altcoins Bounce Back?",
    "url": "https://www.investing.com/news/cryptocurrency-news/bitcoin-gobbles-65-of-crypto-market--will-altcoins-bounce-back-4027072",
    "source": {
      "name": "Investing.com | Stock Market Quotes &amp; Financial News"
    },
    "published_at": "2025-05-07T06:30:19+00:00"
  },
  {
    "title": "BTC/USD Analysis: Is Bitcoin a Safe Haven as Market Cap Hits 2021 Levels?",
    "description": "Bitcoin&#8217;s market share hits a 4-year high, sparking debate about its role as a safe haven asset. On-chain data and technical analysis suggest $93,000-$95,000 is a critical price range. Bitcoin ETFs are seeing increased inflows, particularly BlackRock&#8217;s IBIT, signaling potential bullish movement. Crypto regulation remains complex, with some states like New Hampshire moving forward while [&#8230;]The post BTC/USD Analysis: Is Bitcoin a Safe Haven as Market Cap Hits 2021 Levels? appeared first on Action Forex.",
    "url": "https://www.actionforex.com/contributors/fundamental-analysis/596173-btc-usd-analysis-is-bitcoin-a-safe-haven-as-market-cap-hits-2021-levels/",
    "source": {
      "name": "actionforex"
    },
    "published_at": "2025-05-07T08:07:28+00:00"
  },
  {
    "title": "SC criticises lack of crypto regulation, compares bitcoin trade to hawala",
    "description": "The remarks came during a bail hearing for Shailesh Babulal Bhatt, arrested for alleged illegal Bitcoin trade.",
    "url": "https://www.thehindubusinessline.com/money-and-banking/cryptocurrency/sc-criticises-lack-of-crypto-regulation-compares-bitcoin-trade-to-hawala/article69543473.ece",
    "source": {
      "name": "Business Line"
    },
    "published_at": "2025-05-06T00:01:46+00:00"
  },
  {
    "title": "Bitcoin approaches US$100,000 after breaking through 10-week high",
    "description": "Crypto markets saw a sharp drop in April as Trump unveiled his tariffs against some of the largest U.S. trading partners",
    "url": "https://financialpost.com/fp-finance/cryptocurrency/bitcoin-rally-after-breaking-10-week-high",
    "source": {
      "name": "business"
    },
    "published_at": "2025-05-05T19:52:14+00:00"
  },
  {
    "title": "Massive $318,883,825 in Bitcoin Stun Top Crypto Exchange, Whales Not Giving Up",
    "description": "Massive $318,883,825 in Bitcoin Stun Top Crypto Exchange, Whales Not Giving Up",
    "url": "https://www.investing.com/news/cryptocurrency-news/massive-318883825-in-bitcoin-stun-top-crypto-exchange-whales-not-giving-up-4020877",
    "source": {
      "name": "Investing.com | Stock Market Quotes &amp; Financial News"
    },
    "published_at": "2025-05-02T21:30:21+00:00"
  },
  {
    "title": "UK considers banning bitcoin purchases on credit cards to prevent debt spiral",
    "description": "The UK’s FCA may ban buying bitcoin with credit cards as part of wider crypto crackdown aimed at protecting consumers from high-risk debt and complex crypto lending.Read more: UK considers banning bitcoin purchases on credit cards to prevent debt spiral",
    "url": "https://bmmagazine.co.uk/news/uk-considers-banning-bitcoin-purchases-on-credit-cards-to-prevent-debt-spiral/",
    "source": {
      "name": "Business Matters | The Uk's Leading Sme Business Magazine"
    },
    "published_at": "2025-05-02T11:50:32+00:00"
  },
  {
    "title": "$2.85 Billion Bitcoin and Ethereum Options Expiry Today",
    "description": "Today, the cryptocurrency market braces for a significant event: $2.85 billion worth of Bitcoin (BTC) and Ethereum (ETH) options are set to expire. This massive expiry, with $2.54 billion in BTC options and $316 million in ETH options, is poised to trigger heightened volatility across crypto markets. As traders and investors prepare for potential price [&#8230;]The post $2.85 Billion Bitcoin and Ethereum Options Expiry Today appeared first on ABC Money.",
    "url": "https://www.abcmoney.co.uk/2025/05/2-85-billion-bitcoin-and-ethereum-options-expiry-today/",
    "source": {
      "name": "ABC Money"
    },
    "published_at": "2025-05-02T08:09:58+00:00"
  },
  {
    "title": "PAIRMiner Cloud Mining: Easily Earn Up To $15,000 A Day, Start Your New Era Of Crypto Wealth",
    "description": "As the price of Bitcoin breaks through $96,000, the crypto market has once again entered a high-speed growth channel, and investment enthusiasm has fully recovered. In this wave of bull market, the eyes of global investors are focused on one keyword: cloud mining. As a synonym for passive income in the new era, PAIRMiner is [...]The post PAIRMiner Cloud Mining: Easily Earn Up To $15,000 A Day, Start Your New Era Of Crypto Wealth appeared first on Complete Sports.",
    "url": "https://www.completesports.com/pairminer-cloud-mining-easily-earn-up-to-15000-a-day-start-your-new-era-of-crypto-wealth/",
    "source": {
      "name": "Complete Sports Nigeria"
    },
    "published_at": "2025-05-01T12:51:27+00:00"
  },
  {
    "title": "Bitcoin Miners See Gloomy Quarter Even With Trump on Their Side",
    "description": "Last year on the campaign trail, Donald Trump promised to be a champion of the Bitcoin mining industry in the US. Yet as American crypto miners begin to release their first quarterly earnings reports since Trump returned to the White House, it’s clear the group is struggling.",
    "url": "https://financialpost.com/pmn/business-pmn/bitcoin-miners-see-gloomy-quarter-even-with-trump-on-their-side",
    "source": {
      "name": "business"
    },
    "published_at": "2025-05-01T14:59:57+00:00"
  },
  {
    "title": "BTC to USD: The bridge between crypto hype and real-world value",
    "description": "Cryptocurrencies such as Bitcoin have become so critical to the market at large that understanding BTC to USD has become essential.",
    "url": "https://thedailyrecord.com/2025/05/01/btc-to-usd-crypto-investor-guide/",
    "source": {
      "name": "thedailyrecord"
    },
    "published_at": "2025-05-01T18:28:17+00:00"
  },
  {
    "title": "What is crypto mining and how does it work?",
    "description": "The race to obtain bitcoin and other potentially lucrative cryptocurrencies is tied to a complex virtual process called “mining” — with high risks and high rewards for those who want to get involved. Crypto mining is different than services like Best Wallet, which allows users to manage their cryptocurrency holdings, or Coinbase, which allows them...",
    "url": "https://nypost.com/business/what-is-crypto-mining/",
    "source": {
      "name": "Post"
    },
    "published_at": "2025-05-01T01:15:52+00:00"
  },
  {
    "title": "NC House votes to appoint pension managers, allow state investment in crypto",
    "description": "The North Carolina House gave the green light to a pair of bills this week that would change how the state manages its pension fund and allow that fund&#8217;s investments to include cryptocurrencies like Bitcoin. A five-member board of appointees would manage the state&#8217;s $127 billion in investments under House Bill 506. And House Bill [&#8230;]",
    "url": "https://ncnewsline.com/2025/04/30/nc-house-votes-to-appoint-pension-managers-allow-state-investment-in-crypto/",
    "source": {
      "name": "pulse"
    },
    "published_at": "2025-04-30T20:16:24+00:00"
  }
]