[
  {
    "title": "After A Miserable 2025 First Trust SkyBridge Crypto ETF Looks Ready To Soar in 2026",
    "description": "The First Trust SkyBridge Crypto Industry and Digital Economy ETF (NYSEARCA:CRPT) faced significant headwinds in 2025, disappointing investors who anticipated a crypto renaissance following President Trump&#8217;s election victory and promises to make America the &#8220;crypto capital of the world.&#8221; The fund&#8217;s concentrated bets on Bitcoin miners and proxy stocks delivered challenging returns as the sector ... After A Miserable 2025 First Trust SkyBridge Crypto ETF Looks Ready To Soar in 2026The post After A Miserable 2025 First Trust SkyBridge Crypto ETF Looks Ready To Soar in 2026...",
    "url": "https://247wallst.com/investing/2026/01/03/after-a-miserable-2025-first-trust-skybridge-crypto-etf-looks-ready-to-soar-in-2026/",
    "source": {
      "name": "247wallst"
    },
    "published_at": "2026-01-03T14:30:08+00:00"
  },
  {
    "title": "Blackrock Boosts Crypto Exposure by More Than $22bn in 2025, Finbold Analysis Reveals",
    "description": "BlackRock, the world’s largest asset manager, markedly increased its exposure to digital assets in 2025, adding over $22 billion to its on-chain cryptocurrency portfolio during the year, according to Finbold’s 2025 Cryptocurrency Market Report. From January 1 to December 31, 2025, the combined value of BlackRock’s Bitcoin and Ethereum holdings climbed from $54.8 billion to [&#8230;]The post Blackrock Boosts Crypto Exposure by More Than $22bn in 2025, Finbold Analysis Reveals appeared first on ABC Money.",
    "url": "https://www.abcmoney.co.uk/2026/01/blackrock-boosts-crypto-exposure-by-more-than-22bn-in-2025-finbold-analysis-reveals/",
    "source": {
      "name": "ABC Money"
    },
    "published_at": "2026-01-02T17:21:09+00:00"
  },
  {
    "title": "Ilya Lichtenstein, Bitcoin hacker behind massive crypto theft, credits Trump for early prison release",
    "description": "Ilya Lichtenstein had been sentenced to five years in prison after pleading guilty and admitting to the hack of crypto assets valued in the billions of dollars.",
    "url": "https://www.cnbc.com/2026/01/02/bitcoin-hacker-ilya-lichtenstein-bitfinex-razzlekhan.html",
    "source": {
      "name": "CNBC"
    },
    "published_at": "2026-01-02T19:11:41+00:00"
  },
  {
    "title": "Remember “Bitcoin $250,000” in 2025? Can It At Least Get to $100,000 Again in 2026?",
    "description": "During the crypto bull market of 2025, Bitcoin (CRYPTO:BTC) seemed unstoppable, fueling bold predictions that it would reach $150,000, $250,000, or even higher by year&#8217;s end. Analysts like Tom Lee from Fundstrat projected $200,000 to $250,000. Cathie Wood from ARK Invest still forecasts Bitcoin hitting $1.2 million by 2030. A rising tide can make even ... Remember &#8220;Bitcoin $250,000&#8221; in 2025? Can It At Least Get to $100,000 Again in 2026?The post Remember &#8220;Bitcoin $250,000&#8221; in 2025? Can It At Least Get to $100,000 Again in 2026? appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2026/01/02/remember-bitcoin-250000-in-2025-can-it-at-least-get-to-100000-again-in-2026/",
    "source": {
      "name": "247wallst"
    },
    "published_at": "2026-01-02T15:13:12+00:00"
  },
  {
    "title": "As bitcoin stalls at $88,000, BTC whales rotate into this new cheap crypto for 15x growth potential",
    "description": "Bitcoin often sets the tone for the market, but it does not always lead every phase. When price stalls near major levels, large investors start scanning for better risk and reward setups. Market commentators suggest this is exactly what tends to happen late in strong runs. Capital rotates away from crowded trades and into lower-cost [&#8230;]",
    "url": "https://cyprus-mail.com/2026/01/02/as-bitcoin-stalls-at-88000-btc-whales-rotate-into-this-new-cheap-crypto-for-15x-growth-potential",
    "source": {
      "name": "cyprus-mail"
    },
    "published_at": "2026-01-02T16:10:00+00:00"
  },
  {
    "title": "Trump gets praise from Russian fraudster after early release from prison",
    "description": "Russian-U.S. national Ilya Lichtenstein, who hacked a crypto exchange and stole nearly 120,000 bitcoin, claims he has been freed after only a year into his five-year sentence. Lichtenstein posted on X late Thursday night, saying, “Thanks to President Trump’s First Step Act, I have been released from prison early.”The admitted fraudster pleaded guilty to a money laundering conspiracy charge and admitted to hacking crypto assets now valued in the billions of dollars,\" CNBC reported. The Justice Department calculated the value at approximately $4.5 billion. The First Step Act was a 2018...",
    "url": "https://www.alternet.org/trump-thanked-russian-hacker/",
    "source": {
      "name": "alternet"
    },
    "published_at": "2026-01-02T20:19:01+00:00"
  },
  {
    "title": "3 Cryptos That Could 5x in 2026 If Trump Delivers on Pro-Crypto Promises: XRP, BTC, and One Surprise",
    "description": "The Trump administration spent 2025 building crypto infrastructure. Now comes the payoff. After a year of policy groundwork—from signing the GENIUS Act in July to appointing new SEC and CFTC leadership—the stage is set for 2026 to deliver the institutional wave that could drive Bitcoin (CRYPTO: BTC), Solana (CRYPTO: SOL), and XRP (CRYPTO: XRP) to ... 3 Cryptos That Could 5x in 2026 If Trump Delivers on Pro-Crypto Promises: XRP, BTC, and One SurpriseThe post 3 Cryptos That Could 5x in 2026 If Trump Delivers on Pro-Crypto Promises: XRP, BTC, and One Surprise appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2026/01/01/3-cryptos-that-could-5x-in-2026-if-trump-delivers-on-pro-crypto-promises-xrp-btc-and-one-surprise/",
    "source": {
      "name": "247wallst"
    },
    "published_at": "2026-01-01T14:05:44+00:00"
  },
  {
    "title": "Bitcoin Set For First Yearly Loss Since 2022 As Macro Trends Weigh On Crypto",
    "description": "Despite reaching a fresh record high this year, bitcoin has struggled to regain its footing since October, and last month experienced its biggest monthly drop since mid-2021",
    "url": "https://www.deccanchronicle.com/technology/bitcoin-set-for-first-yearly-loss-since-2022-as-macro-trends-weigh-on-crypto-1927616",
    "source": {
      "name": "deccanchronicle"
    },
    "published_at": "2026-01-01T06:09:36+00:00"
  }
]