[
  {
    "title": "Synagogues across the US targeted in bomb threat Bitcoin extortion campaign",
    "description": "At least six synagogues were targeted in similar incidents that according to Israeli crypto transaction monitoring company Nominis were similar to bomb threat hoaxes in 2018.",
    "url": "https://www.jpost.com/diaspora/antisemitism/article-882705",
    "source": {
      "name": "Jerusalem Post"
    },
    "published_at": "2026-01-08T07:35:47+00:00"
  },
  {
    "title": "Bitcoin Miners Shift From Crypto to AI Data Centers",
    "description": "Bitcoin miners are undergoing a transformation that could redefine the sector. Companies may shift from cryptocurrency mining to high-performance computing infrastructure. Mining revenue is projected to plummet from around 85% of total revenue in early 2025 to less than 20% by the end of 2026 for companies that have secured AI contracts, according to CoinShares&#8217; [...]The post Bitcoin Miners Shift From Crypto to AI Data Centers appeared first on ETF Trends.",
    "url": "https://www.etftrends.com/coinshares-content-hub/bitcoin-miners-shift-crypto-ai-data-centers/",
    "source": {
      "name": "etftrends"
    },
    "published_at": "2026-01-07T19:55:31+00:00"
  },
  {
    "title": "Bitcoin's slide deepens, dragging broader crypto market lower",
    "description": "Bitcoin's slide deepens, dragging broader crypto market lower",
    "url": "https://seekingalpha.com/news/4537403-bitcoins-slide-deepens-dragging-broader-crypto-market-lower?utm_source=feed_news_all&utm_medium=referral&feed_item_type=news",
    "source": {
      "name": "Seeking Alpha"
    },
    "published_at": "2026-01-07T16:46:47+00:00"
  },
  {
    "title": "Bitcoin Breaks Through $90K and Tests $95K: Can January Momentum Push BTC to $100K?",
    "description": "Bitcoin (CRYPTO: BTC) just broke through $90,000 after more than a month of failed attempts. Bitcoin spent December locked between $86,000 and $90,000, testing resistance repeatedly without breaking through. Holiday trading volumes dropped to $30-40 billion, well below levels needed to sustain breakouts, as institutional capital sat on the sidelines. Then early January changed the ... Bitcoin Breaks Through $90K and Tests $95K: Can January Momentum Push BTC to $100K?The post Bitcoin Breaks Through $90K and Tests $95K: Can January Momentum Push BTC to $100K? appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2026/01/07/bitcoin-breaks-through-90k-and-tests-95k-can-january-momentum-push-btc-to-100k/",
    "source": {
      "name": "247wallst"
    },
    "published_at": "2026-01-07T14:12:43+00:00"
  },
  {
    "title": "Is 2026 The Year to Load Up on Crypto Miners?",
    "description": "As Bitcoin mining companies shift to meet data center demand, will volatility in the space calm down? Or are these plays still highly speculative?",
    "url": "https://www.marketbeat.com/stock-ideas/is-2026-the-year-to-load-up-on-crypto-miners/",
    "source": {
      "name": "lulegacy"
    },
    "published_at": "2026-01-07T18:43:00+00:00"
  },
  {
    "title": "Is the Dam Breaking? How Morgan Stanley's Crypto ETFs Could Reshape Finance",
    "description": "In a bold move signaling mainstream finance's deepening embrace of cryptocurrencies, Morgan Stanley (MS) has filed S-1 registration statements with the SEC for spot ETFs tracking Bitcoin (BTC) and Solana (SOL). Yesterday's filings mark the first instance of a major U.S. bank launching its own branded crypto ETFs, rather than merely distributing third-party products. With [&#8230;]The post Is the Dam Breaking? How Morgan Stanley&#039;s Crypto ETFs Could Reshape Finance appeared first on Money Morning - We Make Investing Profitable.",
    "url": "https://moneymorning.com/2026/01/07/is-the-dam-breaking-how-morgan-stanleys-crypto-etfs-could-reshape-finance/",
    "source": {
      "name": "moneymorning"
    },
    "published_at": "2026-01-07T14:12:11+00:00"
  },
  {
    "title": "Silver Overtook Bitcoin on Volatility to End 2025—Can BTC Reclaim “Risk Asset” Crown in 2026?",
    "description": "In December 2025, silver emerged as the more volatile asset over Bitcoin (CRYPTO: BTC) , marking a sharp reversal of long-held assumptions about where macroeconomic risk manifests. While Bitcoin remained stuck near $87,000 in a tight range through late last year, silver surged to $84 per ounce, with gold pushing above $4,550 to all-time highs. ... Silver Overtook Bitcoin on Volatility to End 2025—Can BTC Reclaim &#8220;Risk Asset&#8221; Crown in 2026?The post Silver Overtook Bitcoin on Volatility to End 2025—Can BTC Reclaim &#8220;Risk Asset&#8221; Crown in 2026? appeared first on 24/7 Wall...",
    "url": "https://247wallst.com/investing/2026/01/07/silver-overtook-bitcoin-on-volatility-to-end-2025-can-btc-reclaim-risk-asset-crown-in-2026/",
    "source": {
      "name": "247wallst"
    },
    "published_at": "2026-01-07T14:50:23+00:00"
  },
  {
    "title": "BlackRock Adds Over $22 Billion in Crypto to Its Portfolio",
    "description": "By the end of 2025, BlackRock’s crypto holdings no longer looked like an experiment. The numbers told a steadier story. Bitcoin and Ethereum holdings climbed from $54.8 billion to $77.3 billion in a single year, a 41% increase that suggested planning rather than impulse. Bitcoin remained the anchor. That wasn’t surprising. Institutions tend to move [&#8230;]The post BlackRock Adds Over $22 Billion in Crypto to Its Portfolio appeared first on ABC Money.",
    "url": "https://www.abcmoney.co.uk/2026/01/blackrock-adds-over-22-billion-in-crypto-to-its-portfolio/",
    "source": {
      "name": "ABC Money"
    },
    "published_at": "2026-01-06T17:06:22+00:00"
  },
  {
    "title": "Bitcoin (BTC), Ethereum (ETH) and SOL Rebound Strongly to Start 2026 – Crypto Overview",
    "description": "Cryptocurrencies have been getting whiplashed, with investors noting a stark contrast: despite immense growth in Stock Indexes and Metals, the year-over-year performance for Bitcoin in 2025 was actually negative. Cross-Asset Market Performance in 2025 – Source: TradingView But this headline carries a significant bias. First, year-over-year change fails to capture the total volatility and opportunity [&#8230;]The post Bitcoin (BTC), Ethereum (ETH) and SOL Rebound Strongly to Start 2026 – Crypto Overview appeared first on ActionForex.",
    "url": "https://www.actionforex.com/contributors/technical-analysis/624747-bitcoin-btc-ethereum-eth-and-sol-rebound-strongly-to-start-2026-crypto-overview/",
    "source": {
      "name": "actionforex"
    },
    "published_at": "2026-01-06T16:05:24+00:00"
  },
  {
    "title": "How to pass Bitcoin and crypto to heirs",
    "description": "Roughly 600 million people worldwide now own some form of cryptocurrency, and industry surveys suggest that perhaps half or a bit more use at least one self‑custody wallet where they control their own private keys, rather than relying solely on custodial platforms. And that, estate planning ...",
    "url": "https://www.thestreet.com/investing/how-to-pass-bitcoin-and-crypto-to-heirs",
    "source": {
      "name": "mainstreet"
    },
    "published_at": "2026-01-06T15:33:00+00:00"
  },
  {
    "title": "Metaplanet Buys $451M Bitcoin, Hits 35,102 BTC And Generates $55M Via Options Strategy Like MSTR",
    "description": "On December 30, 2025, Japanese public company Metaplanet announced the purchase of 4,279 Bitcoin (CRYPTO: BTC) for $451 million, bringing total holdings to 35,102 BTC—valued at $3.78 billion. This cements Metaplanet&#8217;s position as the fourth-largest corporate Bitcoin holder globally and demonstrates aggressive commitment to a Bitcoin-centric treasury model. The company expects to generate $55 million ... Metaplanet Buys $451M Bitcoin, Hits 35,102 BTC And Generates $55M Via Options Strategy Like MSTRThe post Metaplanet Buys $451M Bitcoin, Hits 35,102 BTC And Generates $55M Via Options...",
    "url": "https://247wallst.com/investing/2026/01/06/metaplanet-buys-451m-bitcoin-hits-35102-btc-and-generates-55m-via-options-strategy-like-mstr/",
    "source": {
      "name": "247wallst"
    },
    "published_at": "2026-01-06T15:23:47+00:00"
  },
  {
    "title": "Michael Saylor Predicts Bitcoin at $21 Million by 2045—Here’s the Math Behind the Moonshot",
    "description": "Michael Saylor&#8217;s Bitcoin (CRYPTO: BTC) prediction of $21 million per coin by 2046 sounds extreme until framed as a 21-year compounding exercise. Starting near $90,000, reaching $21 million requires roughly 30% annual growth initially, tapering to 21% as Bitcoin matures and volatility declines. The prediction highlights Bitcoin&#8217;s potential as a long-term store of value while ... Michael Saylor Predicts Bitcoin at $21 Million by 2045—Here&#8217;s the Math Behind the MoonshotThe post Michael Saylor Predicts Bitcoin at $21 Million by 2045—Here&#8217;s the Math Behind the Moonshot...",
    "url": "https://247wallst.com/investing/2026/01/06/michael-saylor-predicts-bitcoin-at-21-million-by-2045-heres-the-math-behind-the-moonshot/",
    "source": {
      "name": "247wallst"
    },
    "published_at": "2026-01-06T13:40:31+00:00"
  },
  {
    "title": "Bitcoin (BTC), Ethereum (ETH) and SOL Rebound Strongly to Start 2026 – Crypto Overview",
    "description": "Crypto Market Review: Headlines show Bitcoin down 3% YoY, but ignore the 70% surge to $126k. We dissect the volatility, Ethereum's \"Fusaka\" upgrade, and the massive altcoin wins (ZCash +860%). With risk appetite stable, we analyze the 2026 technical setup for BTC, ETH, and SOL.",
    "url": "https://www.marketpulse.com/markets/bitcoin-btc-ethereum-eth-and-sol-rebound-strongly-to-start-2026-crypto-overview/",
    "source": {
      "name": "forexblog"
    },
    "published_at": "2026-01-06T15:47:00+00:00"
  },
  {
    "title": "XRP ETFs Absorbed $483M in December 2025 While Bitcoin ETFs Lost $1.09B—Why Institutions Chose XRP",
    "description": "December 2025 told two very different stories about institutional crypto appetite. XRP (CRYPTO: XRP) ETFs became the standout winner, pulling in $483 million. Bitcoin ETFs bled $1.09 billion while Ethereum products shed $564 million—yet XRP funds kept attracting fresh money. The disconnect gets stranger when you look at price action. XRP dropped 15% from $2.22 ... XRP ETFs Absorbed $483M in December 2025 While Bitcoin ETFs Lost $1.09B—Why Institutions Chose XRPThe post XRP ETFs Absorbed $483M in December 2025 While Bitcoin ETFs Lost $1.09B—Why Institutions Chose XRP appeared first on 24/7...",
    "url": "https://247wallst.com/investing/2026/01/05/xrp-etfs-absorbed-483m-in-december-2025-while-bitcoin-etfs-lost-1-09b-why-institutions-chose-xrp/",
    "source": {
      "name": "247wallst"
    },
    "published_at": "2026-01-05T15:32:53+00:00"
  },
  {
    "title": "After A Miserable 2025 First Trust SkyBridge Crypto ETF Looks Ready To Soar in 2026",
    "description": "The First Trust SkyBridge Crypto Industry and Digital Economy ETF (NYSEARCA:CRPT) faced significant headwinds in 2025, disappointing investors who anticipated a crypto renaissance following President Trump&#8217;s election victory and promises to make America the &#8220;crypto capital of the world.&#8221; The fund&#8217;s concentrated bets on Bitcoin miners and proxy stocks delivered challenging returns as the sector ... After A Miserable 2025 First Trust SkyBridge Crypto ETF Looks Ready To Soar in 2026The post After A Miserable 2025 First Trust SkyBridge Crypto ETF Looks Ready To Soar in 2026...",
    "url": "https://247wallst.com/investing/2026/01/03/after-a-miserable-2025-first-trust-skybridge-crypto-etf-looks-ready-to-soar-in-2026/",
    "source": {
      "name": "247wallst"
    },
    "published_at": "2026-01-03T14:30:08+00:00"
  },
  {
    "title": "Blackrock Boosts Crypto Exposure by More Than $22bn in 2025, Finbold Analysis Reveals",
    "description": "BlackRock, the world’s largest asset manager, markedly increased its exposure to digital assets in 2025, adding over $22 billion to its on-chain cryptocurrency portfolio during the year, according to Finbold’s 2025 Cryptocurrency Market Report. From January 1 to December 31, 2025, the combined value of BlackRock’s Bitcoin and Ethereum holdings climbed from $54.8 billion to [&#8230;]The post Blackrock Boosts Crypto Exposure by More Than $22bn in 2025, Finbold Analysis Reveals appeared first on ABC Money.",
    "url": "https://www.abcmoney.co.uk/2026/01/blackrock-boosts-crypto-exposure-by-more-than-22bn-in-2025-finbold-analysis-reveals/",
    "source": {
      "name": "ABC Money"
    },
    "published_at": "2026-01-02T17:21:09+00:00"
  },
  {
    "title": "Ilya Lichtenstein, Bitcoin hacker behind massive crypto theft, credits Trump for early prison release",
    "description": "Ilya Lichtenstein had been sentenced to five years in prison after pleading guilty and admitting to the hack of crypto assets valued in the billions of dollars.",
    "url": "https://www.cnbc.com/2026/01/02/bitcoin-hacker-ilya-lichtenstein-bitfinex-razzlekhan.html",
    "source": {
      "name": "CNBC"
    },
    "published_at": "2026-01-02T19:11:41+00:00"
  },
  {
    "title": "Remember “Bitcoin $250,000” in 2025? Can It At Least Get to $100,000 Again in 2026?",
    "description": "During the crypto bull market of 2025, Bitcoin (CRYPTO:BTC) seemed unstoppable, fueling bold predictions that it would reach $150,000, $250,000, or even higher by year&#8217;s end. Analysts like Tom Lee from Fundstrat projected $200,000 to $250,000. Cathie Wood from ARK Invest still forecasts Bitcoin hitting $1.2 million by 2030. A rising tide can make even ... Remember &#8220;Bitcoin $250,000&#8221; in 2025? Can It At Least Get to $100,000 Again in 2026?The post Remember &#8220;Bitcoin $250,000&#8221; in 2025? Can It At Least Get to $100,000 Again in 2026? appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2026/01/02/remember-bitcoin-250000-in-2025-can-it-at-least-get-to-100000-again-in-2026/",
    "source": {
      "name": "247wallst"
    },
    "published_at": "2026-01-02T15:13:12+00:00"
  },
  {
    "title": "As bitcoin stalls at $88,000, BTC whales rotate into this new cheap crypto for 15x growth potential",
    "description": "Bitcoin often sets the tone for the market, but it does not always lead every phase. When price stalls near major levels, large investors start scanning for better risk and reward setups. Market commentators suggest this is exactly what tends to happen late in strong runs. Capital rotates away from crowded trades and into lower-cost [&#8230;]",
    "url": "https://cyprus-mail.com/2026/01/02/as-bitcoin-stalls-at-88000-btc-whales-rotate-into-this-new-cheap-crypto-for-15x-growth-potential",
    "source": {
      "name": "cyprus-mail"
    },
    "published_at": "2026-01-02T16:10:00+00:00"
  },
  {
    "title": "Trump gets praise from Russian fraudster after early release from prison",
    "description": "Russian-U.S. national Ilya Lichtenstein, who hacked a crypto exchange and stole nearly 120,000 bitcoin, claims he has been freed after only a year into his five-year sentence. Lichtenstein posted on X late Thursday night, saying, “Thanks to President Trump’s First Step Act, I have been released from prison early.”The admitted fraudster pleaded guilty to a money laundering conspiracy charge and admitted to hacking crypto assets now valued in the billions of dollars,\" CNBC reported. The Justice Department calculated the value at approximately $4.5 billion. The First Step Act was a 2018...",
    "url": "https://www.alternet.org/trump-thanked-russian-hacker/",
    "source": {
      "name": "alternet"
    },
    "published_at": "2026-01-02T20:19:01+00:00"
  },
  {
    "title": "3 Cryptos That Could 5x in 2026 If Trump Delivers on Pro-Crypto Promises: XRP, BTC, and One Surprise",
    "description": "The Trump administration spent 2025 building crypto infrastructure. Now comes the payoff. After a year of policy groundwork—from signing the GENIUS Act in July to appointing new SEC and CFTC leadership—the stage is set for 2026 to deliver the institutional wave that could drive Bitcoin (CRYPTO: BTC), Solana (CRYPTO: SOL), and XRP (CRYPTO: XRP) to ... 3 Cryptos That Could 5x in 2026 If Trump Delivers on Pro-Crypto Promises: XRP, BTC, and One SurpriseThe post 3 Cryptos That Could 5x in 2026 If Trump Delivers on Pro-Crypto Promises: XRP, BTC, and One Surprise appeared first on 24/7 Wall St..",
    "url": "https://247wallst.com/investing/2026/01/01/3-cryptos-that-could-5x-in-2026-if-trump-delivers-on-pro-crypto-promises-xrp-btc-and-one-surprise/",
    "source": {
      "name": "247wallst"
    },
    "published_at": "2026-01-01T14:05:44+00:00"
  },
  {
    "title": "Bitcoin Set For First Yearly Loss Since 2022 As Macro Trends Weigh On Crypto",
    "description": "Despite reaching a fresh record high this year, bitcoin has struggled to regain its footing since October, and last month experienced its biggest monthly drop since mid-2021",
    "url": "https://www.deccanchronicle.com/technology/bitcoin-set-for-first-yearly-loss-since-2022-as-macro-trends-weigh-on-crypto-1927616",
    "source": {
      "name": "deccanchronicle"
    },
    "published_at": "2026-01-01T06:09:36+00:00"
  }
]