[
    {
        "title": "Trump Media plans $2.5 billion bitcoin reserve",
        "description": "Trump Media CEO describes crypto as ‘an apex instrument of financial freedom’",
        "url": "https://www.independent.co.uk/tech/bitcoin-trump-media-crypto-reserve-b2759242.html",
        "source": {
            "name": "Independent"
        },
        "published_at": "2025-05-28T12:40:35+00:00"
    },
    {
        "title": "Why Betting Sites Are Rushing to Add Crypto Payment Options in 2025",
        "description": "In 2025, online gaming sites are racing to keep up with an accelerating payments environment, and crypto is at the forefront. By Bitcoin or Ethereum, stablecoin or newer blockchain offerings, online casinos and sportsbooks are adopting digital currencies at a rate never before seen. With promotions such as the Winwin promo code inviting new players [&#8230;]The post Why Betting Sites Are Rushing to Add Crypto Payment Options in 2025 appeared first on ABC Money.",
        "url": "https://www.abcmoney.co.uk/2025/05/why-betting-sites-are-rushing-to-add-crypto-payment-options-in-2025/",
        "source": {
            "name": "ABC Money"
        },
        "published_at": "2025-05-29T09:17:24+00:00"
    },
    {
        "title": "Vance urges crypto industry to stay involved in politics as he touts Trump administration’s record",
        "description": "By Alan Suderman Vice President JD Vance praised the cryptocurrency industry Wednesday and urged it to remain active in U.S. politics and policymaking, highlighting the Trump administration&#8217;s close ties to a deep-pocketed industry that&#8217;s become a powerful force in Washington. Speaking at a bitcoin conference in Las Vegas, Vance urged the crypto executives and enthusiasts [&#8230;]",
        "url": "https://winnipegsun.com/pmn/vance-urges-crypto-industry-to-stay-involved-in-politics-as-he-touts-trump-administrations-record",
        "source": {
            "name": "winnipegsun"
        },
        "published_at": "2025-05-28T18:10:53+00:00"
    },
    {
        "title": "The Trump $8b family fortune is being tied to bitcoin",
        "description": "President Donald Trump has made no secret of his love for the crypto industry in his second term. The future of his family’s wealth is banking on it.",
        "url": "https://www.watoday.com.au/business/markets/the-trump-8b-family-fortune-is-being-tied-to-bitcoin-20250529-p5m33x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "source": {
            "name": "watoday"
        },
        "published_at": "2025-05-28T21:09:41+00:00"
    }
]