[
    {
        "title": "Bitcoin Stalled at a Critical Resistance",
        "description": "Market Overview The crypto market cap corrected by 0.4% to $3.10T, pausing the cautious rebound from last Friday. Yet we can’t talk about the rebound running out of steam, as there was strong growth the day before. But we do not see any increase in optimism, as just about one in seven coins has gained [&#8230;]The post Bitcoin Stalled at a Critical Resistance appeared first on Action Forex.",
        "url": "https://www.actionforex.com/contributors/fundamental-analysis/620963-bitcoin-stalled-at-a-critical-resistance/",
        "source": {
            "name": "actionforex"
        },
        "published_at": "2025-11-28T11:03:37+00:00"
    },
    {
        "title": "Mantle MNT Surges 7% on Bybit USDT0 Launch – Breaking Crypto News and Predictions",
        "description": "On November 28, 2025, in the anaerobic cryptocurrency market, Mantle (MNT) is gaining a lot of attention due to a remarkable price rise and ecosystem growth plans. Mantle is an Ethereum Layer-2 scaling solution that is connecting traditional finances and decentralised applications and gaining institutional attention during wider market volatility. As Bitcoin stayed at about [&#8230;]The post Mantle MNT Surges 7% on Bybit USDT0 Launch – Breaking Crypto News and Predictions appeared first on ABC Money.",
        "url": "https://www.abcmoney.co.uk/2025/11/mantle-mnt-surges-7-on-bybit-usdt0-launch-breaking-crypto-news-and-predictions/",
        "source": {
            "name": "ABC Money"
        },
        "published_at": "2025-11-28T06:16:39+00:00"
    },
    {
        "title": "Polkadot DOT Price Drops Amid Hackathon End and ETF Hopes – Top Crypto News",
        "description": "Polkadot (DOT) is a company in the unstable universe of cryptocurrency that is currently grappling with difficult terrain in the last weekend of November 2025. Since the current downward trend of Bitcoin is still shaking the altcoin market, those who own DOT are staring at the wall, hoping that the trend slows down. Its interoperable [&#8230;]The post Polkadot DOT Price Drops Amid Hackathon End and ETF Hopes – Top Crypto News appeared first on ABC Money.",
        "url": "https://www.abcmoney.co.uk/2025/11/polkadot-dot-price-drops-amid-hackathon-end-and-etf-hopes-top-crypto-news/",
        "source": {
            "name": "ABC Money"
        },
        "published_at": "2025-11-28T05:59:08+00:00"
    }
]