[
    {
        "title": "Cardano and Solana rally while Bitcoin holds steady – Monday Crypto update",
        "description": "Bitcoin remains elevated, consolidating between $115K and $120K, as the broader risk-on sentiment lifts markets. BTC, ETH, ADA and Solana analysis as Tech-led equity strength continues to support crypto assets at high levels to start the week.",
        "url": "https://www.marketpulse.com/markets/cardano-and-solana-rally-while-bitcoin-holds-steady-monday-crypto-update/",
        "source": {
            "name": "forexblog"
        },
        "published_at": "2025-07-21T19:17:00+00:00"
    },
    {
        "title": "Trump Media Amasses $2B in Bitcoin, Boosting Trump’s Net Worth",
        "description": "Trump Media builds $2 billion bitcoin hoard, as crypto swells president’s net worth Trump Media and Technology Group said it has accumulated roughly $2 billion in bitcoin and related asset, totaling about two-thirds of its total liquid assets. Shares of TMTG, which trades on the Nasdaq as DJT, popped as high as 9% when markets opened. Trump’s stake in the company — which trades on the Nasdaq under his initials, DJT — is worth nearly $2.3 billion. Trump’s other crypto ventures include the decentralized finance entity World Liberty Financial and the meme coin $TRUMP.",
        "url": "https://www.theyeshivaworld.com/news/liveblogs/live-blog/2427720/trump-media-amasses-2b-in-bitcoin-boosting-trumps-net-worth.html",
        "source": {
            "name": "theyeshivaworld"
        },
        "published_at": "2025-07-21T20:40:48+00:00"
    },
    {
        "title": "Trump Media builds $2 billion bitcoin hoard, as cryptocurrency swells president's net worth",
        "description": "Trump has embraced digital currency to such a degree that crypto now reportedly accounts for most of his net worth.",
        "url": "https://www.cnbc.com/2025/07/21/trump-djt-bitcoin-net-worth.html",
        "source": {
            "name": "CNBC"
        },
        "published_at": "2025-07-21T20:39:18+00:00"
    }
]