[
    {
        "title": "Perennial Investment Advisors LLC Acquires New Stake in iShares Bitcoin Trust (NASDAQ:IBIT)",
        "description": "Perennial Investment Advisors LLC bought a new stake in iShares Bitcoin Trust (NASDAQ:IBIT - Free Report) in the 4th quarter, according to the company in its most recent Form 13F filing with the Securities and Exchange Commission. The fund bought 13,119 shares of the company's stock, valued at appr",
        "url": "https://www.marketbeat.com/instant-alerts/perennial-investment-advisors-llc-acquires-new-stake-in-ishares-bitcoin-trust-nasdaqibit-2025-04-06/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-04-06T09:40:42+00:00"
    },
    {
        "title": "iShares Bitcoin Trust (NASDAQ:IBIT) Shares Purchased by Titleist Asset Management LLC",
        "description": "Titleist Asset Management LLC increased its stake in iShares Bitcoin Trust (NASDAQ:IBIT - Free Report) by 24.1% in the fourth quarter, according to its most recent 13F filing with the Securities &amp; Exchange Commission. The institutional investor owned 63,012 shares of the company's stock after",
        "url": "https://www.marketbeat.com/instant-alerts/ishares-bitcoin-trust-nasdaqibit-shares-purchased-by-titleist-asset-management-llc-2025-04-06/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-04-06T10:09:25+00:00"
    },
    {
        "title": "Ovata Capital Management Ltd Has $22.45 Million Stock Holdings in iShares Bitcoin Trust (NASDAQ:IBIT)",
        "description": "Ovata Capital Management Ltd trimmed its position in iShares Bitcoin Trust (NASDAQ:IBIT - Free Report) by 29.8% in the 4th quarter, according to its most recent 13F filing with the Securities and Exchange Commission. The institutional investor owned 421,268 shares of the company's stock after sell",
        "url": "https://www.marketbeat.com/instant-alerts/ovata-capital-management-ltd-has-2245-million-stock-holdings-in-ishares-bitcoin-trust-nasdaqibit-2025-04-05/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-04-06T09:59:33+00:00"
    },
    {
        "title": "Himension Capital Singapore PTE. LTD. Boosts Stock Position in iShares Bitcoin Trust (NASDAQ:IBIT)",
        "description": "Himension Capital Singapore PTE. LTD. boosted its holdings in iShares Bitcoin Trust (NASDAQ:IBIT - Free Report) by 177.1% during the fourth quarter, according to its most recent Form 13F filing with the SEC. The fund owned 219,508 shares of the company's stock after acquiring an additional 140,293",
        "url": "https://www.marketbeat.com/instant-alerts/himension-capital-singapore-pte-ltd-boosts-stock-position-in-ishares-bitcoin-trust-nasdaqibit-2025-04-06/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-04-06T09:58:15+00:00"
    },
    {
        "title": "iShares Bitcoin Trust (NASDAQ:IBIT) Shares Bought by World Investment Advisors",
        "description": "World Investment Advisors grew its holdings in iShares Bitcoin Trust (NASDAQ:IBIT - Free Report) by 126.2% in the fourth quarter, according to its most recent disclosure with the Securities and Exchange Commission (SEC). The institutional investor owned 26,886 shares of the company's stock after b",
        "url": "https://www.marketbeat.com/instant-alerts/ishares-bitcoin-trust-nasdaqibit-shares-bought-by-world-investment-advisors-2025-04-06/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-04-06T08:40:05+00:00"
    }
]