[
    {
        "title": "XRP jumps 8% after Ripple’s CEO says SEC has dropped its case against the crypto currency",
        "description": "BANGKOK (AP) &#8212; The price of XRP jumped more than 8% Thursday after the CEO of cryptocurrency company Ripple said U.S. regulators have dropped its four-year-old case against the company. The Securities and Exchange Commission sued Ripple and two of its executives in late 2020 after they raised $1.4 billion by selling XRP crypto coins. [&#8230;]",
        "url": "https://financialpost.com/pmn/xrp-jumps-8-after-ripples-ceo-says-sec-has-dropped-its-case-against-the-crypto-currency",
        "source": {
            "name": "Financial Post | Canada Business News"
        },
        "published_at": "2025-03-20T11:55:44+00:00"
    },
    {
        "title": "LG’s NFT marketplace for TVs is shutting down",
        "description": "LG is shutting down Art Lab, its NFT marketplace for TVs. In a notice posted to its website, LG says it has made the “difficult decision&#8221; to close the platform on June 17th.LG launched its Art Lab app during the NFT craze in 2022, billing it as a way to “buy, sell and enjoy high-quality digital artwork” from your TV. It added new digital art to the platform through “groundbreaking” NFT drops, which users could purchase by scanning a QR code to complete transactions through Wallypto, LG’s crypto wallet app.At launch, LG Art Lab operated on the Hedera network, which used a...",
        "url": "https://www.theverge.com/news/633272/lg-art-lab-nft-marketplace-shutdown",
        "source": {
            "name": "The Verge"
        },
        "published_at": "2025-03-20T14:32:14+00:00"
    },
    {
        "title": "Sound Engineer for Eminem Stole and Sold His Songs for Bitcoin, U.S. Says",
        "description": "About 25 unreleased songs by the rapper were discovered online, and investigators traced sales of the music to a former employee, according to federal prosecutors.",
        "url": "https://www.nytimes.com/2025/03/20/us/eminem-music-leaked-engineer-charged.html",
        "source": {
            "name": "The New York Times"
        },
        "published_at": "2025-03-20T22:20:30+00:00"
    },
    {
        "title": "The Crypto Bars are Invading Washington",
        "description": "In a true sign of a vibe shift in Washington, a DC bar beloved by Republican staffers announced that it was shuttering its doors &acirc;&#128;&#147; and will reportedly be replaced by a bar that only accepts cryptocurrency as payment.Local news site PoPville first reported on Thursday that a D.C. outpost of Pubkey, a bar located in Greenwich Village that describes itself as a &acirc;&#128;&#156;vibrant bitcoin community&acirc;&#128;&#157;, had taken over the lease of Hill Country, a popular Texas barbecue restaurant and music venue, which recently announced it would close its doors in Penn...",
        "url": "https://www.theverge.com/cryptocurrency/633590/crypto-bar-pubkey-washington",
        "source": {
            "name": "The Verge"
        },
        "published_at": "2025-03-21T00:22:23+00:00"
    },
    {
        "title": "Bitcoin price today: extends gains to $85k as sentiment improves after Fed meeting",
        "description": "Bitcoin price today: extends gains to $85k as sentiment improves after Fed meeting",
        "url": "https://www.investing.com/news/cryptocurrency-news/bitcoin-price-today-rises-to-85k-as-sentiment-improves-after-the-fed-3938391",
        "source": {
            "name": "Investing.com | Stock Market Quotes &amp; Financial News"
        },
        "published_at": "2025-03-20T14:06:56+00:00"
    }
]