[
    {
        "title": "Billion dollar pizza? Bitcoin soars on key anniversary of crypto’s growth",
        "description": "It&#8217;s not an official holiday &#8212; yet &#8212; but for many cryptocurrency enthusiasts &#8220;Bitcoin Pizza Day&#8221; is still special. Thursday marks the 15th anniversary of the first known use of cryptocurrency to buy real-world goods. The 10,000 bitcoin that software developer Laszlo Hanyecz paid for two Papa John&#8217;s pizzas delivered to his Florida home on [&#8230;]",
        "url": "https://financialpost.com/pmn/billion-dollar-pizza-bitcoin-soars-on-key-anniversary-of-cryptos-growth",
        "source": {
            "name": "Financial Post | Canada Business News"
        },
        "published_at": "2025-05-22T17:20:12+00:00"
    },
    {
        "title": "Crypto industry leaders fear Trump’s putting personal profits first",
        "description": "It seems like a triumph for a cryptocurrency industry that has long sought mainstream acceptance: Top investors in one of President Donald Trump &#8216;s crypto projects invited to dine with him at his luxury golf club in Northern Virginia on the heels of the Senate advancing key pro-crypto legislation and while bitcoin prices soar. But [&#8230;]The post Crypto industry leaders fear Trump’s putting personal profits first appeared first on MACAU DAILY TIMES 澳門每日時報.",
        "url": "https://macaudailytimes.com.mo/crypto-industry-leaders-fear-trumps-putting-personal-profits-first.html",
        "source": {
            "name": "macaudailytimes"
        },
        "published_at": "2025-05-23T00:06:31+00:00"
    },
    {
        "title": "Billion dollar pizza? Bitcoin soars on key anniversary of crypto's growth",
        "description": "It’s not an official holiday – yet – but for many cryptocurrency enthusiasts “Bitcoin Pizza Day” is still special",
        "url": "https://www.marketbeat.com/articles/billion-dollar-pizza-bitcoin-soars-on-key-anniversary-of-cryptos-growth-2025-05-22/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-05-22T17:17:21+00:00"
    },
    {
        "title": "Breaking: Bitcoin Pizza Day Celebrates Crypto’s Historic Moment",
        "description": "Bitcoin Pizza Day marks Bitcoin's first real-world purchase, turning two pizzas into crypto legend—celebrating innovation, community, and blockchain's journey.",
        "url": "https://www.forbes.com/sites/digital-assets/2025/05/22/breaking--bitcoin-pizza-day-celebrates-cryptos-historic-moment/",
        "source": {
            "name": "Forbes"
        },
        "published_at": "2025-05-22T19:57:28+00:00"
    },
    {
        "title": "The crypto industry saw Trump as a champion. Some now fear he’s putting personal profits first",
        "description": "WASHINGTON (AP) — It seems like a triumph for a cryptocurrency industry that has long sought mainstream acceptance: Top investors in one of President Donald Trump ’s crypto projects invited to dine with him at his luxury golf club in Northern Virginia on the heels of the Senate advancing key pro-crypto legislation and while bitcoin [&#8230;]",
        "url": "https://www.mymotherlode.com/news/national/us-government/3911114/the-crypto-industry-saw-trump-as-a-champion-some-now-fear-hes-putting-personal-profits-first.html",
        "source": {
            "name": "mymotherlode"
        },
        "published_at": "2025-05-22T05:14:02+00:00"
    }
]