[
    {
        "title": "Bitcoin Depot buys assets of regional crypto ATM operator",
        "description": "Bitcoin Depot buys assets of regional crypto ATM operator",
        "url": "https://seekingalpha.com/news/4457207-bitcoin-depot-buys-assets-of-regional-crypto-atm-operator?utm_source=feed_news_all&utm_medium=referral&feed_item_type=news",
        "source": {
            "name": "Seeking Alpha"
        },
        "published_at": "2025-06-11T12:16:03+00:00"
    },
    {
        "title": "Crypto bros in twisted NYC kidnap case held 2 other victims ‘against their will,’ DA says while revealing sick new details",
        "description": "The crypto bros who allegedly tortured an Italian millionaire for his Bitcoin password also held two other victims “against their will,” prosecutors revealed Wednesday – along with shocking new details about the Soho house of horrors. John Woeltz, 37, and William Duplessie, 33, pleaded not guilty to kidnapping charges in a dramatic Manhattan Supreme Court...",
        "url": "https://nypost.com/2025/06/11/us-news/crypto-bros-in-nyc-kidnap-case-held-2-other-victims-against-their-will-da/",
        "source": {
            "name": "New York Post"
        },
        "published_at": "2025-06-11T16:11:20+00:00"
    },
    {
        "title": "2 men plead not guilty in New York crypto kidnapping and torture case",
        "description": "NEW YORK (AP) &#8212; Two crypto investors pleaded not guilty on Wednesday to charges they kidnapped and tortured an Italian man for his Bitcoin in an upscale Manhattan townhouse. William Duplessie and John Woeltz were ordered held in custody until their next court date on July 15 during their arraignment in Manhattan criminal court. Their [&#8230;]",
        "url": "https://financialpost.com/pmn/2-men-plead-not-guilty-in-new-york-crypto-kidnapping-and-torture-case",
        "source": {
            "name": "Financial Post | Canada Business News"
        },
        "published_at": "2025-06-11T16:07:41+00:00"
    },
    {
        "title": "2 men plead not guilty in New York crypto kidnapping and torture case",
        "description": "Two crypto investors have pleaded not guilty to charges they kidnapped and tortured an Italian man for his Bitcoin in a Manhattan townhouse. William Duplessie and John Woeltz were ordered held until their next court date on July 15. They were arraigned in Manhattan criminal court Wednesday. Their lawyers had sought their release on $1 million bail. They argued the victim wasn't in distress while in New York and that they had video and photo evidence to prove it. But prosecutors say the two held the accuser captive for 17 days, torturing him until he finally relented and gave them his computer...",
        "url": "https://www.mymotherlode.com/news/national/3983796/2-men-plead-not-guilty-in-new-york-crypto-kidnapping-and-torture-case.html",
        "source": {
            "name": "mymotherlode"
        },
        "published_at": "2025-06-11T16:10:18+00:00"
    },
    {
        "title": "The Crypto Rundown 278: Degenerates Kick Off Summer With A Bang",
        "description": "From bitcoin's volume surges to MSTU call bonanzas, the crypto market is buzzing. We explore all this and more in this episode of The Crypto Rundown.",
        "url": "https://theoptionsinsider.com/radio/crypto/the-crypto-rundown-278-degenerates-kick-off-summer-with-a-bang/",
        "source": {
            "name": "theoptionsinsider"
        },
        "published_at": "2025-06-11T23:03:01+00:00"
    }
]