[
    {
        "title": "Nobel laureate Paul Krugman says Bitcoin’s meltdown is deeply connected to Trump’s waning power: ‘Think of it as the unraveling of the Trump trade’",
        "description": "The Trump family, with ample crypto ventures, has lost an estimated $1 billion from the monthlong cryptocurrency freefall.",
        "url": "https://fortune.com/2025/11/26/nobel-laureate-paul-krugman-bitcoin-meltdown-trump-approval-waning-power/",
        "source": {
            "name": "Fortune"
        },
        "published_at": "2025-11-26T19:36:26+00:00"
    },
    {
        "title": "Bitcoin and Ether are Rolling Over. The Crypto Chaos Might Not Be Over",
        "description": "There&#8217;s a bit of a panic going on in the crypto markets, to say the least, with Bitcoin (CRYPTO:BTC) and Ether (CRYPTO:ETH) both tumbling by a high double-digit percentage in the past month. With Bitcoin hovering around $84,000, there&#8217;s concern that more pain could be in the cards as the technical picture gets a bit ... Bitcoin and Ether are Rolling Over. The Crypto Chaos Might Not Be OverThe post Bitcoin and Ether are Rolling Over. The Crypto Chaos Might Not Be Over appeared first on 24/7 Wall St..",
        "url": "https://247wallst.com/investing/2025/11/26/bitcoin-and-ether-are-rolling-over-the-crypto-chaos-might-not-be-over/",
        "source": {
            "name": "247wallst"
        },
        "published_at": "2025-11-26T13:10:40+00:00"
    },
    {
        "title": "Bitcoin’s (BTC) price prediction looks strong, but this crypto might outpace it by 100x",
        "description": "Bitcoin (BTC) continues to dominate headlines, with a solid recovery as market conditions stabilize and investor confidence gradually returns. While BTC remains the benchmark for digital assets and a bellwether for the broader crypto market, savvy traders are increasingly eyeing Mutuum Finance (MUTM) emerging opportunity with far greater short-term upside. Currently in Phase 6 of [&#8230;]",
        "url": "https://cyprus-mail.com/2025/11/26/bitcoins-btc-price-prediction-looks-strong-but-this-crypto-might-outpace-it-by-100x",
        "source": {
            "name": "cyprus-mail"
        },
        "published_at": "2025-11-26T16:10:00+00:00"
    }
]