[
    {
        "title": "Bigger bitcoin HODL: Time for 10% to 40% of portfolio in crypto, says financial advisor Ric Edelman",
        "description": "Financial advisor Ric Edelman recommends financial advisors hold from 10% to 40% of a portfolio in crypto including bitcoin.",
        "url": "https://www.cnbc.com/2025/06/27/bitcoin-hodl-ric-edelman-wants-10percent-40percent-portfolio-crypto.html",
        "source": {
            "name": "CNBC"
        },
        "published_at": "2025-06-27T21:01:33+00:00"
    },
    {
        "title": "When Trump met crypto",
        "description": "In 2019, President Trump tweeted: \"I am not a fan of Bitcoin and other Cryptocurrencies.\" Today, the Trumps are all over crypto.There are memecoins for Trump and the first lady. They own a stablecoin, a bitcoin mining operation, and a crypto financial services company. And, at the Bitcoin 2025 conference, Trump's media group announced they're raising 2.5 billion dollars from investors to buy bitcoin.At that same conference, speakers included two White House advisors, two sons of the US president, the son of the U.S. Commerce Secretary, and a Trump appointee to the Securities and Exchange...",
        "url": "https://www.npr.org/2025/06/27/1254874796/bitcoin-conference-las-vegas-2025-trump",
        "source": {
            "name": "PLANET"
        },
        "published_at": "2025-06-27T22:39:14+00:00"
    },
    {
        "title": "Best Crypto to buy before June ends, Bitcoin (BTC) looks slow compared to this $0.03 20x altcoin",
        "description": "Bitcoin (BTC) has delivered long-term gains, but its growth rate in 2025 is sluggish compared to newer DeFi opportunities. While BTC crawls forward, one $0.03 DeFi token is pulling ahead with real earning mechanics and live ecosystem development—Mutuum Finance (MUTM). Designed for scalable, non-custodial lending, Mutuum Finance (MUTM) combines a dynamic interest protocol with a [&#8230;]",
        "url": "https://cyprus-mail.com/2025/06/27/best-crypto-to-buy-before-june-ends-bitcoin-btc-looks-slow-compared-to-this-0-03-20x-altcoin",
        "source": {
            "name": "cyprus-mail"
        },
        "published_at": "2025-06-27T13:30:00+00:00"
    }
]