[
    {
        "title": "Musk criticises Trump’s ‘big beautiful bill’, saying tax plans undermine Doge measures – US politics live",
        "description": "Tesla billionaire calls legislation a ‘massive spending bill’ that will add to the federal deficitMusk says Trump tax bill weakens Doge cost-cutting measuresThe vice-president, JD Vance, is scheduled to deliver the keynote address at the Bitcoin 2025 Conference in Vegas, which will set out the Trump administration’s turbocharged approach to the US crypto industry.If you cast your minds back, it’s the same conference Trump spoke at last year in Nashville calling for America to become a “bitcoin superpower” and the “crypto capital of the planet” under his leadership.At 4:30pm ET...",
        "url": "https://www.theguardian.com/us-news/live/2025/may/28/us-politics-live-donald-trump-elon-musk-tax-doge-harvard-students-immigration-news-updates",
        "source": {
            "name": "The Guardian"
        },
        "published_at": "2025-05-28T12:51:53+00:00"
    },
    {
        "title": "Why ‘wrench attacks’ on wealthy crypto holders are on the rise",
        "description": "The headline-grabbing tale of an Italian man who said he was kidnapped and tortured for weeks inside an upscale Manhattan townhouse by captors seeking his bitcoin highlights a dark corner of the cryptocurrency world: the threat of violence by thieves seeking digital assets. The alleged attempted robbery is known as a &#8220;wrench attack.&#8221; It&#8217;s a [&#8230;]",
        "url": "https://financialpost.com/pmn/why-wrench-attacks-on-wealthy-crypto-holders-are-on-the-rise",
        "source": {
            "name": "Financial Post | Canada Business News"
        },
        "published_at": "2025-05-28T15:06:52+00:00"
    },
    {
        "title": "Crypto king who allegedly kidnapped bitcoin millionaire left trail of debts before landing in NYC, becoming big-spending club fixture",
        "description": "William Duplessie, 33, owed hundreds of thousands of dollars on luxury homes and cars in Florida and wracked up criminal trouble in Switzerland for allegedly beating his fiancée.",
        "url": "https://nypost.com/2025/05/28/us-news/crypto-king-who-allegedly-kidnapped-bitcoin-millionaire-left-trail-of-debts-before-landing-in-nyc-becoming-big-spending-club-fixture/",
        "source": {
            "name": "New York Post"
        },
        "published_at": "2025-05-28T23:06:48+00:00"
    },
    {
        "title": "Why “wrench attacks” on wealthy crypto holders are on the rise",
        "description": "The headline-grabbing tale of an Italian man who said he was kidnapped and tortured for weeks inside an upscale Manhattan townhouse by captors seeking his bitcoin highlights a dark corner of the cryptocurrency world: the threat of violence by thieves seeking digital assets. The alleged attempted robbery is known as a “wrench attack.” It’s a [&#8230;]",
        "url": "https://www.mymotherlode.com/news/technology/3930967/why-wrench-attacks-on-wealthy-crypto-holders-are-on-the-rise.html",
        "source": {
            "name": "mymotherlode"
        },
        "published_at": "2025-05-28T15:05:29+00:00"
    },
    {
        "title": "The Trump $8b family fortune is being tied to bitcoin",
        "description": "President Donald Trump has made no secret of his love for the crypto industry in his second term. The future of his family’s wealth is banking on it.",
        "url": "https://www.theage.com.au/business/markets/the-trump-8b-family-fortune-is-being-tied-to-bitcoin-20250529-p5m33x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "source": {
            "name": "theage"
        },
        "published_at": "2025-05-28T21:09:41+00:00"
    }
]