[
    {
        "title": "NYPD probing detectives who worked security at house where man says he was tortured, AP source says",
        "description": "NEW YORK (AP) &#8212; New York City police are investigating two detectives who worked security at an upscale Manhattan townhouse where a man says he was kidnapped and tortured for weeks by two crypto investors who wanted to steal his Bitcoin, a city official said Thursday. One of the detectives serves on Mayor Eric Adams&#8217; [&#8230;]",
        "url": "https://financialpost.com/pmn/nypd-probing-detectives-who-worked-security-at-house-where-man-says-he-was-tortured-ap-source-says",
        "source": {
            "name": "Financial Post | Canada Business News"
        },
        "published_at": "2025-05-29T23:43:11+00:00"
    },
    {
        "title": "NYPD probing detectives who worked security at house where man says he was tortured, AP source says",
        "description": "NEW YORK (AP) — New York City police are investigating two detectives who worked security at an upscale Manhattan townhouse where a man says he was kidnapped and tortured for weeks by two crypto investors who wanted to steal his Bitcoin, a city official said Thursday. One of the detectives serves on Mayor Eric Adams’ [&#8230;]",
        "url": "https://www.mymotherlode.com/news/national/3938674/nypd-probing-detectives-who-worked-security-at-house-where-man-says-he-was-tortured-ap-source-says.html",
        "source": {
            "name": "mymotherlode"
        },
        "published_at": "2025-05-30T00:03:14+00:00"
    },
    {
        "title": "Italian crypto torture victim returned to NYC to reclaim stolen Bitcoin from thieves who then held him hostage for weeks: DA",
        "description": "Michael Valentino Teofrasto Carturan wanted to recoup his stolen bitcoin but was instead held in a nightmarish SoHo torture chamber for nearly three weeks.",
        "url": "https://nypost.com/2025/05/29/us-news/italian-crypto-torture-victim-returned-to-nyc-to-reclaim-stolen-bitcoin-from-thieves-who-then-held-him-hostage-for-weeks-da/",
        "source": {
            "name": "Post"
        },
        "published_at": "2025-05-29T19:13:20+00:00"
    },
    {
        "title": "Judge denies bail to crypto investor charged with kidnapping and torturing man in posh NYC townhouse",
        "description": "NEW YORK (AP) &#8212; A grand jury has indicted a cryptocurrency investor who was charged with kidnapping and torturing a man for weeks in an upscale Manhattan townhouse in order to gain access to his Bitcoin. John Woeltz, 37, has been jailed since his arrest Friday outside the luxury rental, where an Italian national told [&#8230;]",
        "url": "https://financialpost.com/pmn/judge-denies-bail-to-crypto-investor-charged-with-kidnapping-and-torturing-man-in-posh-nyc-townhouse",
        "source": {
            "name": "business"
        },
        "published_at": "2025-05-29T15:41:23+00:00"
    },
    {
        "title": "Judge denies bail to crypto investor charged with kidnapping and torturing man in posh NYC townhouse",
        "description": "NEW YORK (AP) — A grand jury has indicted a cryptocurrency investor who was charged with kidnapping and torturing a man for weeks in an upscale Manhattan townhouse in order to gain access to his Bitcoin. John Woeltz, 37, has been jailed since his arrest Friday outside the luxury rental, where an Italian national told [&#8230;]",
        "url": "https://www.mymotherlode.com/news/national/3936595/judge-denies-bail-to-crypto-investor-charged-with-kidnapping-and-torturing-man-in-posh-nyc-townhouse.html",
        "source": {
            "name": "mymotherlode"
        },
        "published_at": "2025-05-29T16:01:20+00:00"
    }
]