[
    {
        "title": "iShares Bitcoin Trust (NASDAQ:IBIT) Sees Significant Increase in Short Interest",
        "description": "iShares Bitcoin Trust (NASDAQ:IBIT - Get Free Report) was the target of a large increase in short interest in the month of March. As of March 15th, there was short interest totalling 9,170,000 shares, an increase of 53.1% from the February 28th total of 5,990,000 shares. Currently, 1.4% of the shares of the stock are sold short. Based on an average daily volume of 45,809,700 shares, the days-to-cover ratio is currently 0.2 days.",
        "url": "https://www.marketbeat.com/instant-alerts/ishares-bitcoin-trust-nasdaqibit-sees-significant-increase-in-short-interest-2025-03-30/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-03-31T00:00:09+00:00"
    },
    {
        "title": "Ripple to face intense competition from emerging Altcoin Mutuum Finance (MUTM) in 2025, and a top XRP holder worries MUTM will win",
        "description": "Ripple (XRP) has long been a dominant player in the crypto market, especially with its strong institutional backing and role in cross-border payments. However, as 2025 approaches, a new challenger, MUTM stands as a platform that is rapidly capturing attention among top XRP holders and it creates anxiety in this group. MUTM differentiates from Ripple [&#8230;]",
        "url": "https://cyprus-mail.com/2025/03/30/ripple-to-face-intense-competition-from-emerging-altcoin-mutuum-finance-mutm-in-2025-and-a-top-xrp-holder-worries-mutm-will-win",
        "source": {
            "name": "cyprus-mail"
        },
        "published_at": "2025-03-30T15:10:00+00:00"
    },
    {
        "title": "Bitcoin Stocks Worth Watching - March 30th",
        "description": "iShares Bitcoin Trust, MARA, and Core Scientific are the three Bitcoin stocks to watch today, according to MarketBeat's stock screener tool. Bitcoin stocks refer to shares of companies that derive a significant portion of their revenue from bitcoin-related activities, such as mining, trading, or pr",
        "url": "https://www.marketbeat.com/instant-alerts/bitcoin-stocks-worth-watching-march-30th-2025-03-30/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-03-30T18:01:48+00:00"
    },
    {
        "title": "Sen. David McCormick Purchases Shares of Bitwise Bitcoin ETF (NYSEARCA:BITB)",
        "description": "Senator David McCormick (R-Pennsylvania) recently bought shares of Bitwise Bitcoin ETF (NYSEARCA:BITB). In a filing disclosed on March 29th, the Senator disclosed that they had bought between $50,001 and $100,000 in Bitwise Bitcoin ETF stock on March 10th. Senator David McCormick also recently made the following trade(s): Purchased $50,001 &#8211; $100,000 in shares of Bitwise [&#8230;]",
        "url": "https://www.etfdailynews.com/2025/03/30/sen-david-mccormick-purchases-shares-of-bitwise-bitcoin-etf-nysearcabitb/",
        "source": {
            "name": "etfdailynews"
        },
        "published_at": "2025-03-30T06:04:50+00:00"
    },
    {
        "title": "Sen. David McCormick Buys Bitwise Bitcoin ETF (NYSEARCA:BITB) Shares",
        "description": "Sen. David McCormick Buys Bitwise Bitcoin ETF (NYSEARCA:BITB) Shares",
        "url": "https://www.americanbankingnews.com/2025/03/30/sen-david-mccormick-buys-bitwise-bitcoin-etf-nysearcabitb-shares.html",
        "source": {
            "name": "americanbankingnews"
        },
        "published_at": "2025-03-30T06:05:08+00:00"
    }
]