[
    {
        "title": "John Bollinger Says XRP Pattern “Weaker” Than Bitcoin as Peter Brandt Urges Caution Despite 30% Rally",
        "description": "XRP (CRYPTO: XRP) kicked off 2026 with a 30% rally that outpaced Bitcoin and Ethereum. But two legendary technical analysts are pumping the brakes. John Bollinger, creator of the Bollinger Bands indicator, called XRP&#8217;s chart structure &#8220;weaker&#8221; than Bitcoin&#8217;s. Peter Brandt, a veteran trader known for precise pattern analysis, posted a cryptic chart &#8220;without comment&#8221; ... John Bollinger Says XRP Pattern &#8220;Weaker&#8221; Than Bitcoin as Peter Brandt Urges Caution Despite 30% RallyThe post John Bollinger Says XRP Pattern &#8220;Weaker&#8221; Than Bitcoin as...",
        "url": "https://247wallst.com/investing/2026/01/12/john-bollinger-says-xrp-pattern-weaker-than-bitcoin-as-peter-brandt-urges-caution-despite-30-rally/",
        "source": {
            "name": "247wallst"
        },
        "published_at": "2026-01-12T19:30:24+00:00"
    },
    {
        "title": "Altcoin Inflows Diverge From Bitcoin Outflows",
        "description": "Digital asset investment products saw altcoins attract capital even as the broader crypto market recorded $454 million in outflows last week, according to CoinShares. The divergence suggests investors are rotating within crypto rather than exiting the asset class entirely, according to CoinShares’ Monday weekly fund flows report. While bitcoin accounted for $405 million of last [...]The post Altcoin Inflows Diverge From Bitcoin Outflows appeared first on ETF Trends.",
        "url": "https://www.etftrends.com/coinshares-content-hub/altcoin-inflows-diverge-bitcoin-outflows/",
        "source": {
            "name": "etftrends"
        },
        "published_at": "2026-01-12T20:17:08+00:00"
    },
    {
        "title": "Strategy (MSTR) Stock in 2026: Crypto Kick-Start or Another Gut Punch?",
        "description": "Do you like to walk on the wild side? Are you bullish on Bitcoin (CRYPTO:BTC)? If so, then you might consider a share position in Strategy (NASDAQ:MSTR), formerly known as Microstrategy.  As you may be aware, Michael Saylor is Strategy&#8217;s founder and executive chairman and previously served as the company&#8217;s CEO. Saylor is an outspoken champion ... Strategy (MSTR) Stock in 2026: Crypto Kick-Start or Another Gut Punch?The post Strategy (MSTR) Stock in 2026: Crypto Kick-Start or Another Gut Punch? appeared first on 24/7 Wall St..",
        "url": "https://247wallst.com/investing/2026/01/12/strategy-mstr-stock-in-2026-crypto-kick-start-or-another-gut-punch/",
        "source": {
            "name": "247wallst"
        },
        "published_at": "2026-01-12T18:36:09+00:00"
    },
    {
        "title": "Wall Street’s Crypto Takeover: Morgan Stanley Joins BlackRock, Fidelity in $123 Billion Bitcoin ETF Market",
        "description": "The Wall Street Bitcoin ETF takeover has crossed a defining threshold. What began as cautious experimentation has turned into coordinated institutional dominance, with Morgan Stanley joining BlackRock and Fidelity in a Bitcoin ETF market now worth over $123 billion. This reflects the alignment of regulation, client demand, and competitive pressure pulling Bitcoin (CRYPTO: BTC) squarely ... Wall Street&#8217;s Crypto Takeover: Morgan Stanley Joins BlackRock, Fidelity in $123 Billion Bitcoin ETF MarketThe post Wall Street&#8217;s Crypto Takeover: Morgan Stanley Joins BlackRock, Fidelity in $123...",
        "url": "https://247wallst.com/investing/2026/01/12/wall-streets-crypto-takeover-morgan-stanley-joins-blackrock-fidelity-in-123-billion-bitcoin-etf-market/",
        "source": {
            "name": "247wallst"
        },
        "published_at": "2026-01-12T21:44:24+00:00"
    }
]