[
    {
        "title": "Crypto Bloodbath Stalls: Is a Bottom In?",
        "description": "The relentless crypto bloodbath appears to have finally stalled, and signs suggest the market may have already posted a definitive bottom. Bearish acceleration had driven prices to stark troughs, with Bitcoin grazing the $80,000 level and altcoins suffering even steeper declines. XRP plunged below $2.00, Ethereum tested levels near $2,800, and Solana dropped to trade [&#8230;]The post Crypto Bloodbath Stalls: Is a Bottom In? appeared first on Action Forex.",
        "url": "https://www.actionforex.com/contributors/technical-analysis/620400-crypto-bloodbath-stalls-is-a-bottom-in/",
        "source": {
            "name": "actionforex"
        },
        "published_at": "2025-11-25T01:15:48+00:00"
    },
    {
        "title": "Why Bitcoin Lost $900M in ETF Outflows While Solana Gained $531M",
        "description": "In mid-November 2025, investors pulled nearly $900 million from spot Bitcoin ETFs in a single day, marking the second-largest withdrawal since the funds launched in January 2024. The outflows came as Bitcoin (CRYPTO: BTC) fell below $95,000 for the first time in six months. Solana (CRYPTO: SOL) ETFs attracted capital instead. The funds attracted $531 ... Why Bitcoin Lost $900M in ETF Outflows While Solana Gained $531MThe post Why Bitcoin Lost $900M in ETF Outflows While Solana Gained $531M appeared first on 24/7 Wall St..",
        "url": "https://247wallst.com/investing/2025/11/24/why-bitcoin-lost-900m-in-etf-outflows-while-solana-gained-531m/",
        "source": {
            "name": "247wallst"
        },
        "published_at": "2025-11-24T16:56:05+00:00"
    },
    {
        "title": "Dow Plunges 800 Points as Bitcoin Crash Amplifies Market Sell-Off",
        "description": "In November 2025, a sharp stock market sell-off saw the Dow drop over 800 points and Nasdaq fall nearly 3%, amid trade tensions and weak tech earnings. Bitcoin's plunge below $82,000, erasing yearly gains, amplified the downturn through interconnected risks with equities. This highlights crypto's growing influence on traditional markets.",
        "url": "https://www.webpronews.com/dow-plunges-800-points-as-bitcoin-crash-amplifies-market-sell-off/",
        "source": {
            "name": "webpronews"
        },
        "published_at": "2025-11-24T21:40:05+00:00"
    }
]