[
    {
        "title": "TRON Rises as Stablecoin Hub in Volatile Crypto Market",
        "description": "The market cap for TRON (TRX) has grown to $27.59 billion, and it has remained the ninth-largest coin. Investors&#8217; solid confidence is shown in the 3.10% daily rise, lifting Cardano to $0.2909, even though Bitcoin and Ethereum are experiencing a rough time in the markets. Network Activity Fuels Optimism In the last week, TRON’s blockchain [&#8230;]The post TRON Rises as Stablecoin Hub in Volatile Crypto Market appeared first on ABC Money.",
        "url": "https://www.abcmoney.co.uk/2025/06/tron-rises-as-stablecoin-hub-in-volatile-crypto-market/",
        "source": {
            "name": "ABC Money"
        },
        "published_at": "2025-06-10T11:30:56+00:00"
    },
    {
        "title": "Crypto’s hottest new trend: publicly traded companies buying bunches of bitcoin",
        "description": "It’s one of crypto’s hottest trends: publicly traded companies buying bitcoin and then buying even more. President Donald Trump’s media company just announced a plan to raise $2.5 billion to buy bitcoin, joining a growing number of so-called “bitcoin treasury companies” as the world’s most popular cryptocurrency hits all-time highs. The companies buy bitcoin for [&#8230;]",
        "url": "https://www.mymotherlode.com/news/national/3978098/cryptos-hottest-new-trend-publicly-traded-companies-buying-bunches-of-bitcoin.html",
        "source": {
            "name": "mymotherlode"
        },
        "published_at": "2025-06-10T10:02:37+00:00"
    },
    {
        "title": "Crypto’s hottest new trend: publicly traded companies buying bunches of bitcoin",
        "description": "It&#8217;s one of crypto&#8217;s hottest trends: publicly traded companies buying bitcoin and then buying even more. President Donald Trump&#8217;s media company just announced a plan to raise $2.5 billion to buy bitcoin, joining a growing number of so-called &#8220;bitcoin treasury companies&#8221; as the world&#8217;s most popular cryptocurrency hits all-time highs. The companies buy bitcoin for [&#8230;]",
        "url": "https://financialpost.com/pmn/cryptos-hottest-new-trend-publicly-traded-companies-buying-bunches-of-bitcoin",
        "source": {
            "name": "business"
        },
        "published_at": "2025-06-10T10:06:39+00:00"
    }
]