[
    {
        "title": "Bitcoin price today: down to $93k amid rate jitters, DOJ sale pressure",
        "description": "Bitcoin price today: down to $93k amid rate jitters, DOJ sale pressure",
        "url": "https://www.investing.com/news/cryptocurrency-news/bitcoin-price-today-down-to-93k-amid-rate-jitters-doj-sale-pressure-3805807",
        "source": {
            "name": "Investing.com | Stock Market Quotes &amp; Financial News"
        },
        "published_at": "2025-01-10T06:10:35+00:00"
    },
    {
        "title": "Following Mark Cubans’ Lead, Scottie Pippen Backs Bitcoin Despite Major Market Plunge",
        "description": "Scottie Pippen remains steadfast in his beliefs. The basketball legend quickly became the talk of the town when he began posting about his positive opinion on a specific matter&#8211; Bitcoin. Billionaire Mark Cuban might agree with him. Just last year, Pippen made a surprising prediction on social media. And now he&#8217;s doing it again. As [&#8230;]The post Following Mark Cubans&#8217; Lead, Scottie Pippen Backs Bitcoin Despite Major Market Plunge appeared first on EssentiallySports.",
        "url": "https://www.essentiallysports.com/nba-legends-basketball-news-following-mark-cubans-lead-scottie-pippen-backs-bitcoin-despite-major-market-plunge/",
        "source": {
            "name": "Essentially Sports"
        },
        "published_at": "2025-01-10T05:27:14+00:00"
    },
    {
        "title": "Man pleads guilty in failed ransom plot that may have been linked to $240M crypto heist",
        "description": "A Florida man has pleaded guilty in connection with the carjacking and kidnapping of a Connecticut couple, in what authorities call a failed ransom plot that may have been linked to a $240 million cryptocurrency heist. Michael Rivas was one of six men arrested after the series of events in Danbury on Aug. 25. He has plead guilty Thursday to kidnapping and conspiracy in federal court in Hartford and is set to be sentenced in May. The couple were assaulted but survived the ordeal. Danbury police say the FBI was investigating whether the couple's son was involved in a Bitcoin theft a week before...",
        "url": "https://www.mymotherlode.com/news/national/3483472/man-pleads-guilty-in-failed-ransom-plot-that-may-have-been-linked-to-240m-crypto-heist.html",
        "source": {
            "name": "mymotherlode"
        },
        "published_at": "2025-01-09T21:04:35+00:00"
    },
    {
        "title": "Why Choose Swapzone? Key Advantages for Crypto Traders",
        "description": "The cryptocurrency market is vast and ever-evolving, and finding the best crypto exchange for your trading needs can often feel overwhelming. With countless platforms offering varying services, fees, and features, traders need a solution that simplifies and optimizes their experience. Enter Swapzone, an all-in-one cryptocurrency exchange aggregator that is rapidly gaining traction among crypto enthusiasts. From offering [&#8230;]The post Why Choose Swapzone? Key Advantages for Crypto Traders appeared first on ABC Money.",
        "url": "https://www.abcmoney.co.uk/2025/01/why-choose-swapzone-key-advantages-for-crypto-traders/",
        "source": {
            "name": "ABC Money"
        },
        "published_at": "2025-01-10T09:35:58+00:00"
    },
    {
        "title": "Are the elite actually investing in Bitcoin, or is it a fad?",
        "description": "Bitcoin and the cryptocurrency asset class are likely here to stay. And though the speculative asset could continue to be an incredibly choppy ride from here, one can’t help but wonder if the so-called “digital gold” is worth embracing today as the Bitcoin bull’s eye higher highs and a potential breakout past that $100,000 mark. [&#8230;]The post Are the elite actually investing in Bitcoin, or is it a fad? appeared first on 24/7 Wall St..",
        "url": "https://247wallst.com/personal-finance/2025/01/09/are-the-elite-actually-investing-in-bitcoin-or-is-it-a-fad/",
        "source": {
            "name": "247wallst"
        },
        "published_at": "2025-01-09T15:15:05+00:00"
    }
]