[
    {
        "title": "How to Identify Long Term Value Crypto Tokens at Pre Sale",
        "description": "Let me tell you something about crypto pre-sales - they're like panning for gold in a river.",
        "url": "https://www.zeebiz.com/markets/currency/news-how-to-identify-long-term-value-crypto-tokens-at-pre-sale-349870",
        "source": {
            "name": "Zee Business"
        },
        "published_at": "2025-03-05T11:27:34+00:00"
    },
    {
        "title": "Deepfakes, cash and crypto: how call centre scammers duped 6,000 people",
        "description": "Nursing home resident and pensioners among thousands of victims of massive fraud network operating from GeorgiaRevealed: the scammers who conned savers out of $35mWhat is investment fraud and what help is there?Ben Fogle was not a happy man.“Not sure I need to highlight this,” the broadcaster posted on Instagram during the spring of 2024, “but the deepfake of me from [ITV’s] This Morning … circulating on Facebook [and] advertising crypto is a scam.” Continue reading...",
        "url": "https://www.theguardian.com/money/2025/mar/05/deepfakes-cash-and-crypto-how-call-centre-scammers-duped-6000-people",
        "source": {
            "name": "The Guardian"
        },
        "published_at": "2025-03-05T05:30:17+00:00"
    },
    {
        "title": "Bitcoin price today: slumps to $83k as Trump boost reverses, tariff fears weigh",
        "description": "Bitcoin price today: slumps to $83k as Trump boost reverses, tariff fears weigh",
        "url": "https://www.investing.com/news/cryptocurrency-news/bitcoin-price-today-slumps-to-83k-as-trump-boost-reverses-tariff-fears-weigh-3904573",
        "source": {
            "name": "Investing.com | Stock Market Quotes &amp; Financial News"
        },
        "published_at": "2025-03-04T05:42:48+00:00"
    },
    {
        "title": "Revealed: the scammers who conned savers out of $35m using fake celebrity ads",
        "description": "Georgia-based group used deepfake videos and false news featuring Martin Lewis, Zoe Ball and Ben Fogle to promote fraudulent crypto schemesHow call centre scammers duped 6,000 peopleWhat is investment fraud and what help is there?An organised network operating from the former Soviet state of Georgia has scammed thousands of savers from the UK, Europe and Canada out of $35m (£27m) after they fell for fake celebrity adverts on Facebook and Google that the government promised to outlaw three years ago.Deepfake videos and fictional news reports featuring the money expert Martin Lewis, the radio DJ...",
        "url": "https://www.theguardian.com/money/2025/mar/05/revealed-the-scammers-who-conned-savers-out-of-35m-using-fake-celebrity-ads",
        "source": {
            "name": "The Guardian"
        },
        "published_at": "2025-03-05T05:30:17+00:00"
    },
    {
        "title": "The crypto industry got what it paid for",
        "description": "Oh boy, I wonder who will get rich from this!The crypto market never closes, so it was fitting President Donald Trump made the announcement on a Sunday: he was going to reward the billionaires who funded his presidential run.&acirc;&#128;&#156;A U.S. Crypto Reserve will elevate this critical industry after years of corrupt attacks by the Biden Administration,&acirc;&#128;&#157; Trump wrote in a post on Truth Social, a social media website that he owns. His brilliant son Eric made a post suggesting that his father&acirc;&#128;&#153;s announcement qualified as market manipulation. Fantastic.I...",
        "url": "https://www.theverge.com/cryptocurrency/624108/crypto-reserve-bitcoin-trump-grift",
        "source": {
            "name": "The Verge"
        },
        "published_at": "2025-03-04T21:33:58+00:00"
    }
]