[
    {
        "title": "Bitcoin miners stockpile coins to ride out profit squeeze",
        "description": "U.S.-listed groups tap investors for cash as competition for resources intensifies",
        "url": "https://financialpost.com/financial-times/bitcoin-miners-stockpile-coins-profit-squeeze",
        "source": {
            "name": "Financial Post | Canada Business News"
        },
        "published_at": "2025-01-08T16:51:05+00:00"
    },
    {
        "title": "Dogecoin Price Prediction: Can Dogecoin Pump Soon with fans like Elon Musk as JetBolt Traction Mounts",
        "description": "Dogecoin (DOGE) is barking up the crypto tree as it surges 10.2% this week. With highly influential fans like Elon Musk and a growing fascination in the meme coin space, Dogecoin remains at the center of predictions for a potential rally. At the same time, younger JetBolt (JBOLT) is also turning heads thanks to its [&#8230;]",
        "url": "https://www.itnewsafrica.com/2025/01/dogecoin-price-prediction-can-dogecoin-pump-soon-with-fans-like-elon-musk-as-jetbolt-traction-mounts/",
        "source": {
            "name": "itnewsafrica"
        },
        "published_at": "2025-01-08T13:00:27+00:00"
    },
    {
        "title": "Tesla, eBay on Facebook, bitcoin falling: Market Minute",
        "description": "Yahoo Finance host Rachelle Akuffo examines several of the top trending stocks as part of this morning's Market Minute. Tesla (TSLA) could receive $1 billion from rival EV makers that need aid in meeting carbon emission standards in the European Union (EU). Meta Platforms (META) is testing out eBay (EBAY) listings on Facebook in select regions. Bitcoin (BTC-USD) falls below $95,000 on Wednesday with some Wall Street experts anticipating an even bigger drop in the cryptocurrency's price. To watch more expert insights and analysis on the latest market action, check out more Wealth here. This...",
        "url": "https://ca.finance.yahoo.com/video/tesla-ebay-facebook-bitcoin-falling-165735536.html",
        "source": {
            "name": "sports"
        },
        "published_at": "2025-01-08T16:57:35+00:00"
    }
]