[
    {
        "title": "Trump’s presidency is a cash grab",
        "description": "A cutout of President Donald Trump holding a Bitcoin at a crypto conference in Las Vegas, Nevada. | Ian Maule/AFP via Getty Images According to Donald Trump, the 45th and 47th president is a very generous man. “I am proud to be the only President (with the possible exception of the Late, Great George Washington) to donate my Salary,” he said in a Truth Social post. “My first ‘Paycheck’ went to the White House Historical Association, as we make much needed renovations to the beautiful ‘People’s House.’”In his first term, Trump made a big show about donating his government...",
        "url": "https://www.vox.com/politics/460757/trump-crypto-presidency-profits-corruption",
        "source": {
            "name": "VOX"
        },
        "published_at": "2025-09-09T10:30:00+00:00"
    },
    {
        "title": "Crypto Treasury Companies: The Next Big Investment or a Meme-Stock Trap?",
        "description": "In 2020, Michael Saylor’s Strategy (NASDAQ:MSTR) (formerly MicroStrategy) pioneered the crypto treasury company model by acquiring 21,454 Bitcoin (CRYPTO:BTC) for $250 million, sparking a corporate trend of holding digital assets as reserve capital.  Strategy stock has soared over 2,280% in five years, outpacing Bitcoin itself, inspiring imitators like Metaplanet, which has amassed 16,352 BTC. This [&#8230;]The post Crypto Treasury Companies: The Next Big Investment or a Meme-Stock Trap? appeared first on 24/7 Wall St..",
        "url": "https://247wallst.com/investing/2025/09/09/crypto-treasury-companies-the-next-big-investment-or-a-meme-stock-trap/",
        "source": {
            "name": "247wallst"
        },
        "published_at": "2025-09-09T11:33:24+00:00"
    },
    {
        "title": "'Skeptical' expert sounds alarm as Trump family launches new venture",
        "description": "In the past, President Donald Trump was highly critical of cryptocurrencies. Trump said that Bitcoin was \"based on thin air\" and even remarked that it \"seems like a scam.\" But in 2025, Trump has a very different viewpoint, and his company Trump Media & Technology Group is quite bullish on cryptocurrencies.Financial journalist Dominic Basulto examines Trump's latest crypto venture in an article published by Nasdaq.com on September 9 and lays out three \"warnings\" for investors.READ MORE: 'Come over here weenie': Video shows GOP congressman taunting protester before altercation \"The number of ways...",
        "url": "https://www.alternet.org/trump-world-liberty-financial/",
        "source": {
            "name": "alternet"
        },
        "published_at": "2025-09-09T11:08:27+00:00"
    }
]