[
    {
        "title": "Interactive Brokers Expands Crypto Futures Offering with Coinbase Derivatives",
        "description": "Select nano and Perpetual Style Futures Contracts Available Around the Clock GREENWICH, Conn. &#8212; Interactive Brokers (Nasdaq: IBKR), an automated global electronic broker, today announced the launch of Coinbase Derivatives, LLC nano Bitcoin and nano Ether futures contracts for trading on the IBKR platform. These new products are available with monthly expirations or as perpetual-style [&#8230;]",
        "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/interactive-brokers-expands-crypto-futures-offering-with-coinbase-derivatives",
        "source": {
            "name": "Financial Post | Canada Business News"
        },
        "published_at": "2026-02-10T15:16:27+00:00"
    },
    {
        "title": "Major Bitcoin Miner Sells $305 Million Worth of Crypto to Fund Pivot to AI",
        "description": "For the dubious tech of the last decade, one door closes and another one opens.",
        "url": "https://gizmodo.com/major-bitcoin-miner-sells-305-million-worth-of-crypto-to-fund-pivot-to-ai-2000720078",
        "source": {
            "name": "gizmodo"
        },
        "published_at": "2026-02-10T16:10:27+00:00"
    },
    {
        "title": "Crypto Winter Calls for Protected Bitcoin Exposure",
        "description": "It seems safe to say that the crypto winter isn’t showing many signs of warming up any time soon. The price of bitcoin dropped to a new 52-week low on February 5, nearly going below the $60,000 threshold. This represented more than a 52% drop from the cryptocurrency’s sky-high prices in October 2025. As the [...]The post Crypto Winter Calls for Protected Bitcoin Exposure appeared first on ETF Trends.",
        "url": "https://www.etftrends.com/alternatives-content-hub/crypto-winter-calls-protected-bitcoin-exposure/",
        "source": {
            "name": "etftrends"
        },
        "published_at": "2026-02-10T17:54:13+00:00"
    },
    {
        "title": "Oops! South Korean crypto exchange accidentally hands out $40B in Bitcoin",
        "description": "The blunder at Bithumb, South Korea’s second-largest cryptocurrency exchange, briefly turned ordinary users into nine-figure Bitcoin holders.",
        "url": "https://nypost.com/2026/02/10/business/oops-south-korean-crypto-exchange-accidentally-hands-out-40b-in-bitcoin/",
        "source": {
            "name": "Post"
        },
        "published_at": "2026-02-10T20:09:40+00:00"
    },
    {
        "title": "3 Weekly Crypto Dividend ETFs With Ultra High Yields",
        "description": "Crypto investors have been among the most disappointed in the past month as Bitcoin more than halved from its peak while Ethereum barely breached its all-time high this cycle. If you are thinking about buying the dip in order to generate income, weekly crypto dividend exchange-traded funds (ETFs) including the Roundhill Bitcoin Covered Call Strategy ... 3 Weekly Crypto Dividend ETFs With Ultra High YieldsThe post 3 Weekly Crypto Dividend ETFs With Ultra High Yields appeared first on 24/7 Wall St..",
        "url": "https://247wallst.com/investing/2026/02/10/3-weekly-crypto-dividend-etfs-with-ultra-high-yields/",
        "source": {
            "name": "247wallst"
        },
        "published_at": "2026-02-10T15:32:38+00:00"
    }
]