[
    {
        "title": "Coinbase eyes re-entry to India",
        "description": "Coinbase is working on its re-entry to India more than a year after it officially ceased operations in the world&#8217;s most populous nation. The American crypto exchange is engaging with various Indian authorities, including the Financial Intelligence Unit (FIU), an Indian government agency that scrutinizes financial transactions, according to two sources familiar with the matter [&#8230;]© 2024 TechCrunch. All rights reserved. For personal use only.",
        "url": "https://techcrunch.com/2025/02/12/coinbase-eyes-re-entry-to-india/",
        "source": {
            "name": "TechCrunch"
        },
        "published_at": "2025-02-13T04:29:09+00:00"
    },
    {
        "title": "US releases Russian Bitcoin fraud suspect as Belarus frees American",
        "description": "Russian national Alexander Vinnik faced charges for the alleged laundering of billions using Bitcoin.",
        "url": "https://www.bbc.com/news/articles/cy08z28wpvdo",
        "source": {
            "name": "BBC News - US & Canada"
        },
        "published_at": "2025-02-12T18:57:30+00:00"
    },
    {
        "title": "Trump's crypto company launches strategic 'token reserve'",
        "description": "Trump's crypto company launches strategic 'token reserve'",
        "url": "https://www.investing.com/news/economy-news/trumps-crypto-company-launches-strategic-token-reserve-3863315",
        "source": {
            "name": "Investing.com | Stock Market Quotes &amp; Financial News"
        },
        "published_at": "2025-02-12T01:36:21+00:00"
    },
    {
        "title": "Crypto Bros are Trying to Bankrupt Honduras for Scuttling Their Private Cities",
        "description": "U.S. based libertarians and entrepreneurs have longed to build their own private city somewhere in the world where they can set their own laws and eliminate regulations. In 2009, following a military coup in Honduras, the crypto bros got what they were looking for: A deeply corrupt government involved in drug trafficking — and willing MoreThe post Crypto Bros are Trying to Bankrupt Honduras for Scuttling Their Private Cities appeared first on CounterPunch.org.",
        "url": "https://www.counterpunch.org/2025/02/13/crypto-bros-are-trying-to-bankrupt-honduras-for-scuttling-their-private-cities/",
        "source": {
            "name": "counterpunch"
        },
        "published_at": "2025-02-13T06:25:07+00:00"
    },
    {
        "title": "Man who lost nearly $1 billion worth of Bitcoin now wants to buy the landfill",
        "description": "The man who threw out a hard drive in 2013 with 7,500 Bitcoins is now intending to buy the landfill site where he believes the drive is waiting to be found. Continue reading at TweakTown >",
        "url": "https://www.tweaktown.com/news/103208/man-who-lost-nearly-1-billion-worth-of-bitcoin-now-wants-to-buy-the-landfill/index.html",
        "source": {
            "name": "tweaktown"
        },
        "published_at": "2025-02-12T13:13:03+00:00"
    }
]