[
    {
        "title": "US Diplomatic Overload is at Crisis Levels",
        "description": "The US is facing a diplomatic overload crisis on steroids. Worse, the Trump administration is relying on a single, highly inexperienced team to oversee three major negotiations. It remains unclear whether this team &#8211; or a more seasoned one &#8211; can manage what may be the most treacherous of all. Son-in-law Jared Kushner and crypto-bitcoin [&#8230;]",
        "url": "https://dailytimes.com.pk/1453521/us-diplomatic-overload-is-at-crisis-levels/",
        "source": {
            "name": "dailytimes"
        },
        "published_at": "2026-02-18T20:16:33+00:00"
    },
    {
        "title": "$10,000 in XRP or Bitcoin for 2026? 3 AI Models Pick the Winner",
        "description": "If you had $10,000 to put into crypto today, would you choose XRP or Bitcoin? This XRP and Bitcoin comparison uses three AI models to find the answer. XRP (CRYPTO: XRP) trades near $1.50, down 60% from its $3.65 cycle high while Bitcoin (CRYPTO: BTC) hovers around $68,000, down 45% from its peak. Both cryptos ... $10,000 in XRP or Bitcoin for 2026? 3 AI Models Pick the WinnerThe post $10,000 in XRP or Bitcoin for 2026? 3 AI Models Pick the Winner appeared first on 24/7 Wall St..",
        "url": "https://247wallst.com/investing/2026/02/18/10000-in-xrp-or-bitcoin-for-2026-3-ai-models-pick-the-winner/",
        "source": {
            "name": "247wallst"
        },
        "published_at": "2026-02-18T13:58:45+00:00"
    },
    {
        "title": "Fundamentals Over Flows: Why Crypto Winter May Be Healthy Reset",
        "description": "The performance of digital assets in recent months, especially bitcoin, has been testing investor conviction in both the category’s near-term growth potential as well as bitcoin’s standing as a gold-like store of value and a key character in the debasement trade story. As of mid-February, Bitcoin is down some 22% in 2026, extending its losses [...]The post Fundamentals Over Flows: Why Crypto Winter May Be Healthy Reset appeared first on ETF Trends.",
        "url": "https://www.etftrends.com/fundamentals-flows-crypto-winterhealthy-reset/",
        "source": {
            "name": "etftrends"
        },
        "published_at": "2026-02-18T14:12:04+00:00"
    },
    {
        "title": "Goldman Sachs CEO David Solomon, once a crypto skeptic, now says he owns Bitcoin",
        "description": "Under Solomon's leadership, Goldman has deepened crypto involvement, launching trading desks and custody services for institutional clients",
        "url": "https://nypost.com/2026/02/18/business/goldman-sachs-ceo-david-solomon-once-a-crypto-skeptic-now-says-he-owns-bitcoin/",
        "source": {
            "name": "Post"
        },
        "published_at": "2026-02-18T21:27:48+00:00"
    }
]