[
    {
        "title": "Swiss crypto bigwig surrenders to NYPD for questioning in sick SoHo torture case: sources",
        "description": "The founder of a Swiss crypto currently fund was sought for questioning in the horrific kidnapping and torture of a wealthy Italian bitcoin dealer in SoHo.",
        "url": "https://nypost.com/2025/05/27/us-news/swiss-crypto-bigwig-surrenders-to-nypd-for-questioning-in-sick-soho-torture-case-sources/",
        "source": {
            "name": "New York Post"
        },
        "published_at": "2025-05-27T12:56:46+00:00"
    },
    {
        "title": "Trump’s media company says it’s buying $2.5 billion in Bitcoin",
        "description": "President Donald Trump’s media company could soon own $2.5 billion in Bitcoin. On Tuesday, Trump Media announced that it’s working with &#8220;approximately 50 institutional investors&#8221; to sell and issue $1.5 billion in stock and $1 billion in convertible notes. The company, which operates Truth Social among other services, will be used to establish a large holding of Bitcoin.Trump Media says Crypto.com and the crypto banking platform Anchorage Digital will provide custody services for the company’s Bitcoin treasury.&#8220;We view Bitcoin as an apex instrument of financial freedom...",
        "url": "https://www.theverge.com/news/674684/trump-media-bitcoin-treasury-deal",
        "source": {
            "name": "The Verge"
        },
        "published_at": "2025-05-27T14:31:48+00:00"
    },
    {
        "title": "Second crypto investor arrested in bitcoin kidnapping and torture case",
        "description": "Police say William Duplessie and John Woeltz tortured a man for his crypto fortune in a luxury Manhattan townhouse over three weeks.",
        "url": "https://www.courthousenews.com/second-crypto-investor-arrested-in-bitcoin-kidnapping-and-torture-case/",
        "source": {
            "name": "courthousenews"
        },
        "published_at": "2025-05-27T20:34:26+00:00"
    },
    {
        "title": "Alleged Crypto Torture Victim Seen Barefoot, Begging Cop for Help After Escape",
        "description": "The moment a Bitcoin trader finally escaped his alleged crypto hellscape was caught on surveillance -- and the footage is just as dramatic as it sounds. In video obtained by NBC New York, Michael Valentino Teofrasto Carturan can be seen in a casual&hellip;",
        "url": "https://www.tmz.com/2025/05/27/crypto-victim-flees-michael-valentino-teofrasto-carturan-new-york-city/",
        "source": {
            "name": "tmz"
        },
        "published_at": "2025-05-27T18:06:40+00:00"
    },
    {
        "title": "Why it's now time to jump on the Bitcoin bandwagon: As crypto booms, our world-leading experts reveal exactly how you can rake in the cash... and the precautions you MUST take",
        "description": "Bitcoin is hitting new all-time highs once again and is up by close to 50 pc in the last year alone.",
        "url": "https://www.dailymail.co.uk/money/mailplus/article-14754237/Why-time-Bitcoin-bandwagon-crypto.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
        "source": {
            "name": "thisismoney"
        },
        "published_at": "2025-05-27T15:58:23+00:00"
    }
]