[
    {
        "title": "Shiba Inu Crypto Boom: SHIB Price Jumps 4% on TokenPlayAI Deal and Shibarium Fixes in Late 2025",
        "description": "The cryptocurrency giant Shiba Inu (SHIB) is tumbling up on November 27, 2025, as it reported a combination of ecosystem developments and market retrenchment. With the Bitcoin price nearing the 92,000 and Ethereum nearing the 3,100 price, SHIB is priced at around 0.0000085, indicating a 4% increase in its price over a day, as the [&#8230;]The post Shiba Inu Crypto Boom: SHIB Price Jumps 4% on TokenPlayAI Deal and Shibarium Fixes in Late 2025 appeared first on ABC Money.",
        "url": "https://www.abcmoney.co.uk/2025/11/shiba-inu-crypto-boom-shib-price-jumps-4-on-tokenplayai-deal-and-shibarium-fixes-in-late-2025/",
        "source": {
            "name": "ABC Money"
        },
        "published_at": "2025-11-27T08:14:47+00:00"
    },
    {
        "title": "Bitcoin Price Climbs Back Above $90k",
        "description": "Today, Bitcoin is trading above the psychological threshold of $90,000 – a modest consolation for the bulls after BTC/USD fell by around 25% between 1 and 21 November. In our previous post on 18 November, we discussed why Bitcoin had been declining, highlighting the high leverage across the crypto market. The events of 21 November [&#8230;]The post Bitcoin Price Climbs Back Above $90k appeared first on Action Forex.",
        "url": "https://www.actionforex.com/contributors/technical-analysis/620816-bitcoin-price-climbs-back-above-90k/",
        "source": {
            "name": "actionforex"
        },
        "published_at": "2025-11-27T09:24:53+00:00"
    },
    {
        "title": "Sui Crypto Surge: TVL Tops $1 Billion Again in November 2025 Amid RWA Token Launch and Price Rally",
        "description": "In the cryptocurrency sphere, where the competition is stiff, Sui has turned into an impressive player on November 27, 2025, with its impressive network expansion and strategic tricks. As Bitcoin moves near the $91,000 range and Ethereum breaks through to the 3,060 range, Sui, the native token, is trading at an average of $1.55, which [&#8230;]The post Sui Crypto Surge: TVL Tops $1 Billion Again in November 2025 Amid RWA Token Launch and Price Rally appeared first on ABC Money.",
        "url": "https://www.abcmoney.co.uk/2025/11/sui-crypto-surge-tvl-tops-1-billion-again-in-november-2025-amid-rwa-token-launch-and-price-rally/",
        "source": {
            "name": "ABC Money"
        },
        "published_at": "2025-11-27T08:02:28+00:00"
    }
]