[
    {
        "title": "How to Audit a Presale? Step-by-Step Guide",
        "description": "As the market is going bullish, people have started to wonder, “What if they had bought Bitcoin in the early days?” or “What if they had been able to grab Ethereum when it was available as a crypto presale?” These are legitimate questions to ask, especially since popular crypto presales are still able to provide [&#8230;]The post How to Audit a Presale? Step-by-Step Guide appeared first on ABC Money.",
        "url": "https://www.abcmoney.co.uk/2025/08/how-to-audit-a-presale-step-by-step-guide/",
        "source": {
            "name": "ABC Money"
        },
        "published_at": "2025-08-28T15:58:03+00:00"
    },
    {
        "title": "Trump family-backed American Bitcoin to trade on Nasdaq as crypto investors sign on",
        "description": "American Bitcoin's co-founder, Eric Trump, his brother Donald Trump Jr. and Hut 8, will own a combined 98% of the newly formed entity, which will retain the name American Bitcoin and trade under the stock code ABTC.",
        "url": "https://nypost.com/2025/08/28/business/trump-family-backed-american-bitcoin-to-trade-on-nasdaq-as-crypto-investors-sign-on/",
        "source": {
            "name": "Post"
        },
        "published_at": "2025-08-28T16:06:52+00:00"
    },
    {
        "title": "A $0.035 Crypto with $3 ambitions, even as Bitcoin (BTC) gains 2.4% weekly to $112,000",
        "description": "Bitcoin (BTC) has once again reminded the market why it is considered the benchmark of digital assets. With a steady 2.4% weekly gain, its price has reached $112,000, cementing its role as the safe haven for long-term holders. Yet for investors wondering what is going on with crypto today, the real opportunity often lies in [&#8230;]",
        "url": "https://cyprus-mail.com/2025/08/28/a-0-035-crypto-with-3-ambitions-even-as-bitcoin-btc-gains-2-4-weekly-to-112000",
        "source": {
            "name": "cyprus-mail"
        },
        "published_at": "2025-08-28T15:40:00+00:00"
    }
]