[
    {
        "title": "Cryptocurrencies extend their decline from recent highs",
        "description": "Cryptos face a sharp pullback after signs of exhaustion. Bitcoin’s failure to hold its all-time high and Ethereum’s rejection near $4,870 signaled hesitancy, while altcoins showed weaker demand. With digital assets tied to risk sentiment, fresh geopolitical tensions added pressure, prompting investors to lock in profits. BTC and ETH charts now hold the key to what’s next with an extra update on the Market Cap.",
        "url": "https://www.marketpulse.com/markets/cryptocurrencies-extend-their-decline-from-recent-highs/",
        "source": {
            "name": "forexblog"
        },
        "published_at": "2025-08-18T13:22:00+00:00"
    },
    {
        "title": "Bitcoin Down To $116,000: 'Shakeout' Before Going Higher Or Final Stop Before $112,000?",
        "description": "Even as Bitcoin (CRYPTO: BTC) slipped below $115,000 on Monday morning after rejecting resistance at $122,000 over the weekend, analysts are pointing to a decisive test at $112,000 that could determine whether the read more",
        "url": "https://www.benzinga.com/crypto/cryptocurrency/25/08/47191744/bitcoin-down-to-116000-shakeout-before-going-higher-or-final-stop-before-112000",
        "source": {
            "name": "benzinga"
        },
        "published_at": "2025-08-18T17:06:09+00:00"
    },
    {
        "title": "Applied Digital Breaks Through $16. APLD Stock to $30 or $10 Next?",
        "description": "Applied Digital (APLD) is the first crypto company that has managed to successfully transition from being a struggling Bitcoin miner to a high-growth AI computing company. Many other crypto mining companies are trying to pull off what it has done, to varying levels of success. However, APLD stock is still outperforming them. It has broken [&#8230;]The post Applied Digital Breaks Through $16. APLD Stock to $30 or $10 Next? appeared first on Money Morning - We Make Investing Profitable.",
        "url": "https://moneymorning.com/2025/08/18/applied-digital-breaks-through-16-apld-stock-to-30-or-10-next/",
        "source": {
            "name": "moneymorning"
        },
        "published_at": "2025-08-18T22:54:27+00:00"
    }
]