[
    {
        "title": "Trump calls for creation of a ‘crypto strategic reserve’",
        "description": "President Donald Trump is throwing his support behind the idea of creating a federal reserve of cryptocurrency assets — he specifically mentioned XRP, Solana, and Cardano, but not Bitcoin or Ethereum. In January, Trump issued an executive order calling for the creation of a working group that would study and make recommendations around crypto policy, [&#8230;]© 2024 TechCrunch. All rights reserved. For personal use only.",
        "url": "https://techcrunch.com/2025/03/02/trump-calls-for-creation-of-crypto-strategic-reserve/",
        "source": {
            "name": "TechCrunch"
        },
        "published_at": "2025-03-02T16:31:55+00:00"
    },
    {
        "title": "Trump sparks crypto rally by saying more coins to be in reserve",
        "description": "Ripple was up nearly 30% at around $2.80, while Solana climbed some 20% to around $170.",
        "url": "https://fortune.com/crypto/2025/03/02/trump-bitcoin-crypto-reserve-xrp-sol-ada-btc-eth-prices/",
        "source": {
            "name": "Fortune"
        },
        "published_at": "2025-03-02T17:48:08+00:00"
    },
    {
        "title": "Bitcoin price falls by 17.5% in biggest monthly loss since 2022",
        "description": "Cryptocurrency slips into technical bear market as optimism after Donald Trump’s election win fadesBitcoin has recorded its largest monthly loss since June 2022, pushing it into a bear market as the euphoria over cryptocurrencies after Donald Trump’s election win faded.The price of bitcoin fell by 17.5% in February, the biggest monthly drop since June 2022, and its 11th worst month in the last decade, as negative sentiment gripped financial markets. Continue reading...",
        "url": "https://www.theguardian.com/technology/2025/mar/02/bitcoin-price-falls-biggest-monthly-loss-since-june-2022",
        "source": {
            "name": "The Guardian"
        },
        "published_at": "2025-03-02T17:18:42+00:00"
    },
    {
        "title": "Bitcoin, other cryptocurrencies rally as Trump announces U.S. crypto reserve",
        "description": "Bitcoin, other cryptocurrencies rally as Trump announces U.S. crypto reserve",
        "url": "https://www.investing.com/news/cryptocurrency-news/bitcoin-other-cryptocurrencies-rally-as-trump-announces-us-crypto-reserve-3901339",
        "source": {
            "name": "Investing.com | Stock Market Quotes &amp; Financial News"
        },
        "published_at": "2025-03-02T18:57:16+00:00"
    },
    {
        "title": "Trump names Bitcoin and others as part of coming ‘Crypto Strategic Reserve’",
        "description": "In a pair of social media posts today, President Donald Trump named some cryptocurrencies he says will be part of a Crypto Strategic Reserve being created by an executive order he signed in January. Those include Bitcoin and Ether, which he says “will be the heart of the Reserve.” Trump said in the first of his two Truth Social posts that his order “directed the Presidential Working Group to move forward on a Crypto Strategic Reserve” that also includes XRP, Solana (SOL), and Cardano (ADA). Trump hinted at such a reserve on the campaign trail, telling attendees of a crypto conference...",
        "url": "https://www.theverge.com/news/622538/trump",
        "source": {
            "name": "The Verge"
        },
        "published_at": "2025-03-02T20:48:01+00:00"
    }
]