[
    {
        "title": "The Crypto Rundown 284: Buying Pizza on PayPal with Pudgy Penguins",
        "description": "Buy pizza with Bitcoin via PayPal? We break down the massive adoption news & more with Bill Ulivieri from Cenacle Capital & crypto options analytics from Amberdata.",
        "url": "https://theoptionsinsider.com/radio/crypto/the-crypto-rundown-284-buying-pizza-on-paypal-with-pudgy-penguins/",
        "source": {
            "name": "theoptionsinsider"
        },
        "published_at": "2025-07-30T12:13:59+00:00"
    },
    {
        "title": "Samsung Partners with Coinbase for Direct Crypto Buys via Samsung Pay",
        "description": "Samsung has partnered with Coinbase to integrate Samsung Pay into the Coinbase app, enabling Galaxy users in the US and Canada to buy cryptocurrencies like Bitcoin and Ethereum directly via their smartphones, bypassing traditional banks. This move, launched July 29, 2025, aims to normalize crypto adoption and bridge fiat and digital currencies.",
        "url": "https://www.webpronews.com/samsung-partners-with-coinbase-for-direct-crypto-buys-via-samsung-pay/",
        "source": {
            "name": "webpronews"
        },
        "published_at": "2025-07-30T16:23:41+00:00"
    },
    {
        "title": "PayPal Expands Crypto Payments: 100+ Coins for U.S. Merchants with Fee Cuts",
        "description": "PayPal has expanded its \"Pay with Crypto\" feature, allowing U.S. merchants to accept over 100 cryptocurrencies like Bitcoin and XRP for payments, with near-instant settlements and up to 90% fee reductions on cross-border transactions. This strategic move aims to streamline global commerce while mitigating volatility risks through seamless fiat conversions.",
        "url": "https://www.webpronews.com/paypal-expands-crypto-payments-100-coins-for-u-s-merchants-with-fee-cuts/",
        "source": {
            "name": "webpronews"
        },
        "published_at": "2025-07-30T13:16:43+00:00"
    },
    {
        "title": "Mogo Initiates Process to Obtain Full Crypto Regulatory Approval in Canada",
        "description": "Positioning to Become the First Publicly Traded Company in Canada to Offer Both Equity and Crypto Trading Aligned with $50M Bitcoin Treasury Strategy and IntelligentInvesting.ai Rollout VANCOUVER, British Columbia &#8212; Mogo Inc. (“Mogo” or the “Company”) (NASDAQ: MOGO; TSX: MOGO), a digital wealth and payments company on a mission to build the future of intelligent [&#8230;]",
        "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/mogo-initiates-process-to-obtain-full-crypto-regulatory-approval-in-canada",
        "source": {
            "name": "business"
        },
        "published_at": "2025-07-30T12:17:57+00:00"
    }
]