[
    {
        "title": "BYDFi Lists GUNZ Token: Gunzilla Games Raises Nearly $100M, Ushering in the Next Era of AAA Web3 Gaming",
        "description": "VICTORIA, Seychelles, March 31, 2025 (GLOBE NEWSWIRE) &#8212; The globally renowned crypto exchange BYDFi today announced the global listing of the GUNZ token($GUN), the native asset of the GUNZ Layer1 blockchain developed by German AAA game studio Gunzilla Games. As one of the first crypto economies purpose-built for AAA gaming, GUNZ is rapidly emerging as [&#8230;]",
        "url": "https://financialpost.com/globe-newswire/bydfi-lists-gunz-token-gunzilla-games-raises-nearly-100m-ushering-in-the-next-era-of-aaa-web3-gaming",
        "source": {
            "name": "Financial Post | Canada Business News"
        },
        "published_at": "2025-03-31T18:37:28+00:00"
    },
    {
        "title": "Digi Power Reports 115% Quarterly Revenue Growth in Q1 2025, Maintains Debt-Free Operations and Strengthens Cash Position",
        "description": "MIAMI, April 01, 2025 (GLOBE NEWSWIRE) &#8212; Digi Power X Inc. (“Digi Power X” or the “Company”) (Nasdaq: DGXX / TSXV: DGX), an innovative energy infrastructure company that develops cutting-edge data centers, is pleased to provide unaudited comparative Bitcoin (“BTC”) production results for the first quarter ended March 31, 2025, combined with an operations update. [&#8230;]",
        "url": "https://financialpost.com/globe-newswire/digi-power-reports-115-quarterly-revenue-growth-in-q1-2025-maintains-debt-free-operations-and-strengthens-cash-position",
        "source": {
            "name": "Financial Post | Canada Business News"
        },
        "published_at": "2025-04-01T11:32:08+00:00"
    },
    {
        "title": "Matador Technologies Announces New CTO and Lead Designer for Upcoming Digital Gold Product on Bitcoin",
        "description": "TORONTO, March 31, 2025 (GLOBE NEWSWIRE) &#8212; Matador Technologies Inc. (“Matador” or the “Company”) (TSXV: MATA, OTCQB: MTDTF) announces the addition of two members to its team as the Company advances toward the launch of its digital gold product on the Bitcoin network in early 2025. Antoine De Vuyst has joined Matador as Chief Technology [&#8230;]",
        "url": "https://financialpost.com/globe-newswire/matador-technologies-announces-new-cto-and-lead-designer-for-upcoming-digital-gold-product-on-bitcoin",
        "source": {
            "name": "Financial Post | Canada Business News"
        },
        "published_at": "2025-03-31T11:00:46+00:00"
    },
    {
        "title": "Bitcoin investor buys an entire SpaceX flight for the ultimate polar adventure",
        "description": "A bitcoin investor who bought a SpaceX flight for himself and three polar explorers blasted off Monday night on the first rocket ride to carry people over the North and South poles.",
        "url": "https://phys.org/news/2025-04-bitcoin-investor-buys-entire-spacex.html",
        "source": {
            "name": "Phys.org - News And Articles On Science And Technology"
        },
        "published_at": "2025-04-01T08:39:30+00:00"
    },
    {
        "title": "Japan to give crypto assets legal status as financial products: Report",
        "description": "Japan's Financial Services Agency (FSA) plans to revise the Financial Instruments and Exchange Act to give crypto assets a legal status as financial products, the Nikkei business daily said",
        "url": "https://www.thehindu.com/sci-tech/technology/japan-to-give-crypto-assets-legal-status-as-financial-products-report/article69395196.ece",
        "source": {
            "name": "The Hindu"
        },
        "published_at": "2025-03-31T03:48:11+00:00"
    }
]