[
    {
        "title": "Coinbase Down 12% From November Peak as Crypto Exchange Faces Growing Skepticism Over Revenue Sustainability",
        "description": "Shares of Coinbase (NASDAQ:COIN) have fallen 11% in the last month, coinciding with a sharp turn in retail investor sentiment across Reddit and X. Once a darling of crypto bulls during Bitcoin&#8217;s run to all-time highs, Coinbase now faces mounting skepticism as traders question whether the party is over. Bitcoin&#8217;s slide below $93,872 (after hitting ... Coinbase Down 12% From November Peak as Crypto Exchange Faces Growing Skepticism Over Revenue SustainabilityThe post Coinbase Down 12% From November Peak as Crypto Exchange Faces Growing Skepticism Over Revenue Sustainability appeared...",
        "url": "https://247wallst.com/investing/2025/12/09/coinbase-down-12-from-november-peak-as-crypto-exchange-faces-growing-skepticism-over-revenue-sustainability/",
        "source": {
            "name": "247wallst"
        },
        "published_at": "2025-12-09T16:40:00+00:00"
    },
    {
        "title": "Bitcoin vs. XRP: Which Is the Better Long-Term Bet Right Now?",
        "description": "Choosing between two top-tier dominant forces in any particular sector can be a difficult task. In the world of crypto, investors looking to put long-term capital to work in tokens they view as long-term stores of value outside the monetary system do have a few choices to choose from.  Of course, there&#8217;s the first (and ... Bitcoin vs. XRP: Which Is the Better Long-Term Bet Right Now?The post Bitcoin vs. XRP: Which Is the Better Long-Term Bet Right Now? appeared first on 24/7 Wall St..",
        "url": "https://247wallst.com/investing/2025/12/09/bitcoin-vs-xrp-which-is-the-better-long-term-bet-right-now/",
        "source": {
            "name": "247wallst"
        },
        "published_at": "2025-12-09T14:29:18+00:00"
    },
    {
        "title": "There's no Dow or S&P 500 for cryptocurrencies yet. Bitwise is getting a step closer with new ETF",
        "description": "The move comes despite a series of recent pullbacks in the crypto market that saw bitcoin trade at around $85,000 earlier this month.",
        "url": "https://www.cnbc.com/2025/12/09/theres-no-dow-or-sp-500-for-cryptocurrencies-yet-bitwise-is-getting-a-step-closer-with-new-etf.html",
        "source": {
            "name": "CNBC"
        },
        "published_at": "2025-12-09T16:58:12+00:00"
    },
    {
        "title": "Strategy (MSTR) Turned $1,000 Into $637 in 2025: 4D Chess or Checkmate?",
        "description": "Strategy (NASDAQ:MSTR) has bet everything on Bitcoin (CRYPTO:BTC), transforming from a software firm into the world&#8217;s largest corporate holder of the digital asset. But 2025&#8217;s crypto winter has frozen that strategy, with bitcoin prices sliding amid interest rate uncertainty and macroeconomic headwinds. A $1,000 investment in Strategy at the start of the year would now ... Strategy (MSTR) Turned $1,000 Into $637 in 2025: 4D Chess or Checkmate?The post Strategy (MSTR) Turned $1,000 Into $637 in 2025: 4D Chess or Checkmate? appeared first on 24/7 Wall St..",
        "url": "https://247wallst.com/investing/2025/12/09/strategy-mstr-turned-1000-into-637-in-2025-4d-chess-or-checkmate/",
        "source": {
            "name": "247wallst"
        },
        "published_at": "2025-12-09T17:30:34+00:00"
    }
]