[
    {
        "title": "Saylor’s Contrarian Bet Morphs Into Full-Blown Crypto Gold Rush",
        "description": "TLGY Acquisition Corp. put a pitch in front of investors in April entitled “MicroStrategy 2.0,” a reference to the Bitcoin-accumulation company run by Michael Saylor. Only TLGY wasn’t planning to buy Bitcoin.",
        "url": "https://financialpost.com/pmn/business-pmn/saylors-contrarian-bet-morphs-into-full-blown-crypto-gold-rush",
        "source": {
            "name": "Financial Post | Canada Business News"
        },
        "published_at": "2025-05-30T15:27:07+00:00"
    },
    {
        "title": "Hard-partying crypto bro looks haggard in NYC court as he awaits indictment in sick kidnap, torture case",
        "description": "A haggard-looking crypto king made another court appearance Friday over his alleged sadistic torture of an Italian businessman for his Bitcoin password.",
        "url": "https://nypost.com/2025/05/30/us-news/hard-partying-crypto-bro-looks-haggard-in-nyc-court-as-he-awaits-indictment-in-sick-kidnap-torture-case/",
        "source": {
            "name": "New York Post"
        },
        "published_at": "2025-05-30T16:06:25+00:00"
    },
    {
        "title": "2nd suspect in Manhattan crypto kidnapping and torture case indicted",
        "description": "NEW YORK (AP) &#8212; A second man charged in the kidnapping and torture of an Italian man for his Bitcoin has been indicted. A Manhattan grand jury handed up the indictment Friday against William Duplessie, according to Manhattan District Attorney Alvin Bragg&#8217;s office. The indictment will remain sealed until his arraignment June 11. Duplessie, 32, [&#8230;]",
        "url": "https://financialpost.com/pmn/2nd-suspect-in-manhattan-crypto-kidnapping-and-torture-case-indicted",
        "source": {
            "name": "business"
        },
        "published_at": "2025-05-30T21:32:46+00:00"
    },
    {
        "title": "How to Buy a Car with Crypto: A Bold Shift in the Automotive Industry",
        "description": "Driving the Future: Why More People Buy Cars with Bitcoin and Crypto The thought of cruising off in a new ride, paid for entirely in crypto, used to sound futuristic. Today, it’s becoming standard practice. As cryptocurrency reshapes how cars are bought and sold, the auto industry is adapting fast. Where Convenience Meets Innovation From [&#8230;]The post How to Buy a Car with Crypto: A Bold Shift in the Automotive Industry appeared first on ABC Money.",
        "url": "https://www.abcmoney.co.uk/2025/05/how-to-buy-a-car-with-crypto-a-bold-shift-in-the-automotive-industry/",
        "source": {
            "name": "ABC Money"
        },
        "published_at": "2025-05-30T14:56:32+00:00"
    },
    {
        "title": "Cash is no longer king? Nigel Farage vows to lead a 'crypto revolution' bringing Britain 'properly into the 21st century' after vowing to protect hard currency before election",
        "description": "The Reform leader, who is facing accusations of having 'fantasy' economic plans, told Bitcoin 25 in Las Vegas he wanted to 'bring our country properly into the 21st century'.",
        "url": "https://www.dailymail.co.uk/news/article-14764205/Cash-king-Nigel-Farage-crypto-revolution-Britain-Bitcoin.html?ns_mchannel=rss&ito=1490&ns_campaign=1490",
        "source": {
            "name": "dailymail"
        },
        "published_at": "2025-05-30T08:56:14+00:00"
    }
]