[
    {
        "title": "As Bitcoin Erases 2025's Gains, Fear of a Crypto Winter Creep In",
        "description": "Bitcoin's Deep Freeze: 2025 Gains Completely Erased Bitcoin (BTC) can't stop falling. After hitting an all-time high of $126,272 on Oct. 6, the cryptocurrency has lost over 27% of its value and currently trades at around $91,655. Every bit of progress Bitcoin made this year has been lost. It has slipped firmly into bear market [&#8230;]The post As Bitcoin Erases 2025&#039;s Gains, Fear of a Crypto Winter Creep In appeared first on Money Morning - We Make Investing Profitable.",
        "url": "https://moneymorning.com/2025/11/19/as-bitcoin-erases-2025s-gains-fear-of-a-crypto-winter-creep-in/",
        "source": {
            "name": "moneymorning"
        },
        "published_at": "2025-11-19T14:37:35+00:00"
    },
    {
        "title": "Abu Dhabi Fund Tripled Bitcoin Bet in Months Before Crypto Crash",
        "description": "The Abu Dhabi Investment Council more than tripled the size of its position in a Bitcoin exchange-traded fund during the third quarter, shortly before the bull market in cryptocurrencies gave way to a brutal selloff.",
        "url": "https://financialpost.com/pmn/business-pmn/abu-dhabi-fund-tripled-bitcoin-bet-in-months-before-crypto-crash",
        "source": {
            "name": "business"
        },
        "published_at": "2025-11-19T12:38:06+00:00"
    },
    {
        "title": "SEC’s Crypto Pivot: From Scrutiny to Sideline as AI Takes Center Stage",
        "description": "The SEC has dropped crypto from its 2026 examination priorities, shifting focus to AI, cybersecurity, and private credit risks amid a pro-crypto Trump administration. This sparked a 2% Bitcoin bounce but highlights potential crises in the $1.7 trillion private credit sector. Industry insiders see it as a regulatory thaw fostering innovation.",
        "url": "https://www.webpronews.com/secs-crypto-pivot-from-scrutiny-to-sideline-as-ai-takes-center-stage/",
        "source": {
            "name": "webpronews"
        },
        "published_at": "2025-11-19T12:55:19+00:00"
    }
]