[
    {
        "title": "‘The ultimate liberty’: how Nigel Farage became a cryptocurrency convert",
        "description": "Reform leader aims to make London a ‘crypto powerhouse’ and has previously hailed an ‘economic insurgency’As Liz Truss prepared to make a U-turn on her mini-budget in October 2022, Nigel Farage discussed the economic instability on his GB News show. But he was not broadcasting from the channel’s studios in Paddington. Instead, Farage was speaking from a bitcoin conference in Amsterdam.“With inflation forecast to perhaps get up to 20%, with increasing distrust of fiat currencies, people are looking for alternatives … Are you ready for bitcoin?” he said in his opening remarks...",
        "url": "https://www.theguardian.com/politics/2025/may/30/how-nigel-farage-became-a-cryptocurrency-convert",
        "source": {
            "name": "The Guardian"
        },
        "published_at": "2025-05-30T05:00:44+00:00"
    },
    {
        "title": "SBP, finance ministry say crypto is illegal—despite govt promotion",
        "description": "ISLAMABAD: Pakistan’s top financial authorities have confirmed that cryptocurrency is still illegal in the country. This comes even as the government promotes digital assets like Bitcoin. The State Bank of Pakistan (SBP) and the Ministry of Finance both said crypto transactions remain banned under current laws. Finance Secretary Imdadullah Bosal told parliament that no legal [&#8230;]",
        "url": "https://dailytimes.com.pk/1308709/sbp-finance-ministry-say-crypto-is-illegal-despite-govt-promotion/",
        "source": {
            "name": "dailytimes"
        },
        "published_at": "2025-05-30T09:54:05+00:00"
    },
    {
        "title": "Pakistan launches first govt-led Bitcoin reserve",
        "description": "Bilal Bin Saqib, Pakistan&#8217;s minister for crypto and blockchain and the CEO of the Pakistan Crypto Council (PCC), unveiled the country&#8217;s first government-led strategic bitcoin reserve at Bitcoin Vegas 2025, his office said on Thursday. The strategic bitcoin reserve is a reserve asset, funded by the United States Treasury&#8217;s forfeited bitcoin, announced by President Donald [&#8230;]",
        "url": "https://dailytimes.com.pk/1308515/pakistan-launches-first-govt-led-bitcoin-reserve/",
        "source": {
            "name": "dailytimes"
        },
        "published_at": "2025-05-30T06:38:31+00:00"
    },
    {
        "title": "Mayor Adams uses taxpayer-funded crypto trip to fundraise, with help from NYC’s top tech official",
        "description": "Mayor Eric Adams used his taxpayer-funded Las Vegas trip to a bitcoin convention to fill his campaign coffers with regular cash from crypto bros -- with help from the city's top tech official, The Post has learned.",
        "url": "https://nypost.com/2025/05/29/us-news/mayor-adams-uses-taxpayer-funded-crypto-trip-to-fundraise/",
        "source": {
            "name": "Post"
        },
        "published_at": "2025-05-29T13:05:54+00:00"
    }
]