[
    {
        "title": "Man wants to buy tip where he lost Bitcoin fortune",
        "description": "James Howells wants to search a landfill site where he lost for 8,000 bitcoins now worth about £620m.",
        "url": "https://www.bbc.com/news/articles/cj3eg3n11gvo",
        "source": {
            "name": "BBC"
        },
        "published_at": "2025-02-09T21:58:13+00:00"
    },
    {
        "title": "Top 10 Crypto Betting Sites For Super Bowl 2025 - Sportscasting",
        "description": "Top 10 Crypto Betting Sites For Super Bowl 2025&nbsp;&nbsp;SportscastingCrypto Adoption in Sports Betting: bet105 Leading the Way&nbsp;&nbsp;PR Newswire UKBitcoin Super Bowl Prop: Will it Go Up or Down During SB59?&nbsp;&nbsp;Legal Sports BettingEssential tips for smarter wagers: Master crypto betting with expert strategies&nbsp;&nbsp;BusinessCloudCryptocurrency and High-Stakes Digital Adventures&nbsp;&nbsp;PWInsider",
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNUlpsTlYzV3lyNmFUTDBuWVZfV2JQOHVjYnFkWVRjb2tMazJrd2ZWXzN6UV9MM3UxSHNGUjhnNTZDLVFNXzlGWWg2RGpWOG16ZkthTjd2alN6dXFYVUN1OFlWZ0JIRU02LVZLSXdYVTJCczZib3RZSUw1aFNWYnEzSndjbUxrd1pZQ2VXLURnSjJjOV95bm53MVpSWmxvdw?oc=5",
        "source": {
            "name": "Google News Business US"
        },
        "published_at": "2025-02-09T23:37:19+00:00"
    },
    {
        "title": "Bitcoin Stocks To Keep An Eye On - February 09th",
        "description": "iShares Bitcoin Trust, CleanSpark, MARA, Riot Platforms, Iris Energy, TeraWulf, and Core Scientific are the seven Bitcoin stocks to watch today, according to MarketBeat's stock screener tool. Bitcoin stocks refer to publicly traded companies that have exposure to or a direct involvement in the cryp",
        "url": "https://www.marketbeat.com/instant-alerts/bitcoin-stocks-to-keep-an-eye-on-february-09th-2025-02-09/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-02-09T19:07:38+00:00"
    },
    {
        "title": "MicroStrategy Incorporated (MSTR) – Bitcoin and AI Convergence Fuels Strategic Growth",
        "description": "We recently published a list of 10 AI Stocks Dominating Wall Street. In this article, we are going to take a look at where MicroStrategy Incorporated (NASDAQ:MSTR) stands against other AI stocks dominating Wall Street. Representatives from around the world are going to be attending the Artificial Intelligence (AI) Summit at the Grand Palais on […]",
        "url": "https://ca.finance.yahoo.com/news/microstrategy-incorporated-mstr-bitcoin-ai-214735477.html",
        "source": {
            "name": "sports"
        },
        "published_at": "2025-02-09T21:47:35+00:00"
    },
    {
        "title": "Crypto kidnapping – hapless Brit gang arrested in under 7 hours",
        "description": "Like some farce directed by Guy Ritchie, three British men have been dramatically arrested in the Costa del Sol for [&#8230;]",
        "url": "https://euroweeklynews.com/2025/02/09/crypto-kidnapping-hapless-brit-gang-arrested-in-under-7-hours/",
        "source": {
            "name": "euroweeklynews"
        },
        "published_at": "2025-02-09T13:06:34+00:00"
    }
]