[
    {
        "title": "Stock Market Today: Dow Falls In Post-Rally Gyrations; Bitcoin Play Flashes Sell Signal As Crypto Falls (Live Coverage) - Investor's Business Daily",
        "description": "Stock Market Today: Dow Falls In Post-Rally Gyrations; Bitcoin Play Flashes Sell Signal As Crypto Falls (Live Coverage)&nbsp;&nbsp;Investor's Business DailyStocks slip on Wall Street after last week's rally&nbsp;&nbsp;ca.finance.yahoo.comDow Jones Futures Fall; Nvidia Is Next Big Market Test After Powell-Led Rally&nbsp;&nbsp;Investor's Business DailyWall Street Halts Rally as Fed-Cut Euphoria Fades: Markets Wrap&nbsp;&nbsp;Bloomberg.comStocks slip on Wall Street after last week’s rally&nbsp;&nbsp;CTV News",
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxONGF4M24yWTBNVW1kUFBrR3pIMlIzeHlFN0FXbXJKZmk2VnQ3c0ZWOVFQVVNHU1I3dHVPYjN0RDNJMXo5NjdPZHgwNElTVDk0UENWTWY3QXMzQlBzcHNkdFJVOUFfbEFGOTRkR2M1S1ZDUzMxc0ZNOUNjN2I1blN5WlRiMDdkLXRkb0ExUHM3RmFZZWZBU3VfZzYzeDc0eDBXZWdhSkExT1luMW5mWkgzRVBwX1FkYUtUbnNBV08tSGNldE85U21wNzJ2RWk?oc=5",
        "source": {
            "name": "Google News Business CA"
        },
        "published_at": "2025-08-25T16:11:00+00:00"
    },
    {
        "title": "AI Mining, Gamification, and Antminer S23: BeMine Wraps Up Crypto Summer Amid Explosive Growth in ASIC and AI Mining",
        "description": "Discover how BeMine's Crypto Summer 2025 combines AI mining, gamification, and next-gen ASICs like Antminer S21 Hydro to reshape Bitcoin mining.",
        "url": "https://www.ibtimes.com.au/ai-mining-gamification-antminer-s23-bemine-wraps-crypto-summer-amid-explosive-growth-asic-ai-1860250",
        "source": {
            "name": "International Business Times Au"
        },
        "published_at": "2025-08-25T18:48:18+00:00"
    },
    {
        "title": "Bitcoin Flash Crash Roils Crypto Market",
        "description": "Did a single whale disrupt the crypto ocean?",
        "url": "https://gizmodo.com/bitcoin-price-flash-crash-ether-thiel-2000647613",
        "source": {
            "name": "gizmodo"
        },
        "published_at": "2025-08-25T17:50:49+00:00"
    },
    {
        "title": "Bitcoin Drags Crypto Down",
        "description": "Market Overview The crypto market capitalisation fell to $3.91 trillion, down 2% in the past day and 3.5% from last week’s peak, as Bitcoin came under pressure following Friday’s surge. The dynamics on Sunday were noteworthy, when the sell-off of the first cryptocurrency coincided with Ethereum setting historic highs. Solana is also doing well, adding [&#8230;]The post Bitcoin Drags Crypto Down appeared first on Action Forex.",
        "url": "https://www.actionforex.com/contributors/fundamental-analysis/609321-bitcoin-drags-crypto-down/",
        "source": {
            "name": "actionforex"
        },
        "published_at": "2025-08-25T12:05:46+00:00"
    },
    {
        "title": "Crypto news today: Mutuum Finance (MUTM) sparks analyst buzz after Bitcoin (BTC) faces $800M in liquidations ahead of Jackson Hole",
        "description": "The market shook this week as over $800 million in Bitcoin (BTC) positions were liquidated, rattling sentiment and leaving many wondering what is going on with crypto today. While headlines focus on the turbulence, analysts are pointing at an emerging DeFi project, Mutuum Finance (MUTM), as a striking outlier. With its presale gathering strong momentum, [&#8230;]",
        "url": "https://cyprus-mail.com/2025/08/25/crypto-news-today-mutuum-finance-mutm-sparks-analyst-buzz-after-bitcoin-btc-faces-800m-in-liquidations-ahead-of-jackson-hole",
        "source": {
            "name": "cyprus-mail"
        },
        "published_at": "2025-08-25T13:30:00+00:00"
    }
]