[
    {
        "title": "BlackRock adds $24 bln to crypto portfolio",
        "description": "BlackRock significantly ramped up its digital asset exposure in the first half of 2025, adding nearly $24 bln to its crypto portfolio, according to Finbold’s H1 2025 Cryptocurrency Market Report. The asset manager’s holdings climbed from $54.77 bln on January 1 to $78.67 bln by June 30, a 30.38% increase, driven primarily by inflows into its spot Bitcoin and Ethereum ETFs, which launched earlier this year. “This surge in on-chain holdings reflects massive investor demand for spot crypto ETFs and BlackRock’s strategic positioning to meet it,” said Jordan Major, senior analyst at ...",
        "url": "https://www.financialmirror.com/2025/07/09/blackrock-adds-24-bln-to-crypto-portfolio/",
        "source": {
            "name": "financialmirror"
        },
        "published_at": "2025-07-09T12:03:45+00:00"
    },
    {
        "title": "The Rise of Crypto Payments And Their Limitations",
        "description": "Cryptocurrencies are increasingly available. However, due to the uncertainty surrounding their legality, there are still limited places available to make crypto payments. Of course, right from the get-go, Bitcoin was used to purchase a pizza, so it&#8217;s only a matter of time before customers start demanding this payment method is more widely available and better [&#8230;]The post The Rise of Crypto Payments And Their Limitations appeared first on ABC Money.",
        "url": "https://www.abcmoney.co.uk/2025/07/can-crypto-payments-go-mainstream/",
        "source": {
            "name": "ABC Money"
        },
        "published_at": "2025-07-09T12:38:35+00:00"
    },
    {
        "title": "Crypto Data Centers Converting Into AI Data Centers",
        "description": "CoreWeave is buying Core Scientific, Bitcoin miner, for $9 billion. It is an all-stock deal to speed up AI data center construction and deployment. • Core Scientific’s 1.3 GW power capacity over 11 U.S. sites • $10B in lease savings, $500M in annual cost cuts by 2027 HIVE estimates 10 MW of NVIDIA H100 GPUs ... Read more",
        "url": "https://www.nextbigfuture.com/2025/07/crypto-data-centers-converting-into-ai-data-centers.html",
        "source": {
            "name": "nextbigfuture"
        },
        "published_at": "2025-07-10T00:18:53+00:00"
    },
    {
        "title": "Bitcoin rises to fresh record above $112,000, helped by Nvidia-led tech rally",
        "description": "Bitcoin hit a fresh record on Wednesday afternoon as an Nvidia-led rally in equities helped lift the crypto's price into the stock market close.",
        "url": "https://www.cnbc.com/2025/07/09/crypto-market-today.html",
        "source": {
            "name": "CNBC"
        },
        "published_at": "2025-07-09T21:03:33+00:00"
    }
]