[
    {
        "title": "Bitcoin Hits Record High Ahead Of ‘Crypto Week’",
        "description": "House Republicans called the upcoming “Crypto Week” a step to make the U.S. the “crypto capital of the world.”",
        "url": "https://www.forbes.com/sites/tylerroush/2025/07/10/bitcoin-hits-record-high-ahead-of-crypto-week/",
        "source": {
            "name": "Forbes"
        },
        "published_at": "2025-07-10T23:41:00+00:00"
    },
    {
        "title": "Bitcoin reaches fresh all-time high in market-wide breakout — what’s next?",
        "description": "Crypto markets surge to new all-time highs after months of range-bound trading. Institutional inflows, ETF expansion, and dollar diversification fuel momentum. Check out potential levels of interest through Daily and intra-day chart analysis and how the Market Cap is looking.",
        "url": "https://www.marketpulse.com/markets/bitcoin-reaches-fresh-all-time-high-in-market-wide-breakout-whats-next/",
        "source": {
            "name": "forexblog"
        },
        "published_at": "2025-07-10T19:10:00+00:00"
    },
    {
        "title": "Bitcoin price all-time high: What’s behind crypto’s record-breaking rally – and how high could it go?",
        "description": "The cryptocurrency’s latest price surge has revived ‘digital gold’ comparisons",
        "url": "https://www.independent.co.uk/tech/bitcoin-price-record-explained-crypto-b2786287.html",
        "source": {
            "name": "Independent"
        },
        "published_at": "2025-07-10T12:35:17+00:00"
    },
    {
        "title": "Best Cryptos to buy as Metaplanet acquires 2,205 more Bitcoins",
        "description": "Japanese investment firm Metaplanet is bolstering its Bitcoin holdings, recently snapping up 2,205 additional BTC, valued at roughly $238.7 million. This brings their total to 15,555 BTC, worth approximately $1.7 billion.  The move signals strong corporate confidence in Bitcoin as a treasury asset, fueling optimism in the crypto market. As Bitcoin’s bullish momentum grows, investors [&#8230;]",
        "url": "https://cyprus-mail.com/2025/07/10/best-cryptos-to-buy-as-metaplanet-acquires-2205-more-bitcoins",
        "source": {
            "name": "cyprus-mail"
        },
        "published_at": "2025-07-10T15:10:00+00:00"
    }
]