[
    {
        "title": "“You Can’t Rip Off Your Fans”— Joe Rogan Unravels Khamzat Chimaev Crypto Scam’s Truth",
        "description": "Elon Musk’s obsession with &#8216;Doge&#8217; is nothing short of legendary. Whether it’s a meme coin or, bizarrely, a government agency acronym. But have you ever wondered how he sleeps peacefully at night knowing people are yeeting their life savings into digital dog memes? Well, he doesn’t seem too bothered. &#8220;If you expect to win at [&#8230;]The post “You Can’t Rip Off Your Fans”— Joe Rogan Unravels Khamzat Chimaev Crypto Scam’s Truth appeared first on EssentiallySports.",
        "url": "https://www.essentiallysports.com/ufc-mma-news-you-cant-rip-off-your-fans-joe-rogan-unravels-khamzat-chimaev-crypto-scams-truth/",
        "source": {
            "name": "Essentially Sports"
        },
        "published_at": "2025-03-13T03:16:08+00:00"
    },
    {
        "title": "At US request, India arrests crypto administrator accused of money laundering",
        "description": "At US request, India arrests crypto administrator accused of money laundering",
        "url": "https://www.investing.com/news/stock-market-news/at-us-request-india-arrests-crypto-administrator-accused-of-money-laundering-3925623",
        "source": {
            "name": "Investing.com | Stock Market Quotes &amp; Financial News"
        },
        "published_at": "2025-03-13T01:35:46+00:00"
    },
    {
        "title": "San Francisco Reporter Confirms Why 49ers are Low Balling Brock Purdy As Kyle Shanahan Gets Mac Jones As Backup QB",
        "description": "“Be where my feet are,” Brock Purdy once mused, his words floating through the Bay Area like a foggy morning mantra. But in the NFL, where feet move faster than Bitcoin prices, standing still isn’t an option. Especially when you’re the $3.7-million-a-year quarterback who just tossed 20 TDs, flirted with 3.8K+ yards yet couldn’t pull [&#8230;]The post San Francisco Reporter Confirms Why 49ers are Low Balling Brock Purdy As Kyle Shanahan Gets Mac Jones As Backup QB appeared first on EssentiallySports.",
        "url": "https://www.essentiallysports.com/nfl-active-news-an-francisco-reporter-confirms-why-49ers-are-low-balling-brock-purdy-as-kyle-shanahan-gets-mac-jones-as-backup-qb/",
        "source": {
            "name": "Essentially Sports"
        },
        "published_at": "2025-03-13T10:30:46+00:00"
    },
    {
        "title": "Telegram introduces trading and yield features for its self-custodial crypto wallet",
        "description": "Telegram&#8217;s self-custodial crypto wallet, developed by a third-party company called The Open Platform (TOP), has introduced new features for people who don&#8217;t just use Telegram as a messaging app. The updates include multi-asset trading and yield functionalities. Based on the TON blockchain, TOP launched the wallet in 2023. The company reported that over 100 million [&#8230;]© 2024 TechCrunch. All rights reserved. For personal use only.",
        "url": "https://techcrunch.com/2025/03/13/telegram-introduces-trading-and-yield-features-for-its-self-custodial-crypto-wallet/",
        "source": {
            "name": "TechCrunch"
        },
        "published_at": "2025-03-13T10:14:56+00:00"
    },
    {
        "title": "Sage Mountain Advisors LLC Buys Shares of 5,790 iShares Bitcoin Trust (NASDAQ:IBIT)",
        "description": "Sage Mountain Advisors LLC bought a new stake in shares of iShares Bitcoin Trust (NASDAQ:IBIT - Free Report) in the 4th quarter, according to the company in its most recent filing with the SEC. The fund bought 5,790 shares of the company's stock, valued at approximately $307,000. Several other inst",
        "url": "https://www.marketbeat.com/instant-alerts/sage-mountain-advisors-llc-buys-shares-of-5790-ishares-bitcoin-trust-nasdaqibit-2025-03-13/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-03-13T08:18:12+00:00"
    }
]