[
    {
        "title": "Crypto Bears Brunt of Risk-Off Moves After Trump Unveils Tariffs",
        "description": "A slump in cryptocurrencies weighed heavily on some of the more speculative digital assets late Sunday in the US, a sign investors will slash risk when markets open Monday following new tariffs imposed by Donald Trump.",
        "url": "https://financialpost.com/pmn/business-pmn/crypto-bears-brunt-of-risk-off-moves-after-trump-unveils-tariffs",
        "source": {
            "name": "Financial Post | Canada Business News"
        },
        "published_at": "2025-02-02T22:48:36+00:00"
    },
    {
        "title": "Trump’s Crypto Obsession is More About Ideology Than Transforming Global Trade Policy",
        "description": "The Trump administration's fascination with Bitcoin, other cryptocurrencies and meme coins has triggered a bullish rush by investors to cash in on the crypto craze, and even sparked lofty claims that crypto could help pay off the US's debts. There's just one problem, says digital economy specialist Ashraf Patel: other countries aren't buying it.",
        "url": "https://sputnikglobe.com/20250202/trumps-crypto-obsession-is-more-about-ideology-than-transforming-global-trade-policy-1121529318.html",
        "source": {
            "name": "en"
        },
        "published_at": "2025-02-02T17:19:15+00:00"
    },
    {
        "title": "Financial Stocks To Watch Today - February 02nd",
        "description": "Visa, ServiceNow, Berkshire Hathaway, Mastercard, iShares Bitcoin Trust, UnitedHealth Group, and ProShares UltraPro Short QQQ are the seven Financial stocks to watch today, according to MarketBeat's stock screener tool. Financial stocks refer to the shares of companies operating in the financial se",
        "url": "https://www.marketbeat.com/instant-alerts/financial-stocks-to-watch-today-february-02nd-2025-02-02/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-02-02T17:15:17+00:00"
    },
    {
        "title": "Riggs Asset Managment Co. Inc. Takes $4 Million Position in iShares Bitcoin Trust (NASDAQ:IBIT)",
        "description": "Riggs Asset Managment Co. Inc. acquired a new position in iShares Bitcoin Trust (NASDAQ:IBIT - Free Report) during the 4th quarter, according to its most recent filing with the SEC. The fund acquired 74,662 shares of the company's stock, valued at approximately $3,998,000. A number of other large i",
        "url": "https://www.marketbeat.com/instant-alerts/riggs-asset-managment-co-inc-takes-4-million-position-in-ishares-bitcoin-trust-nasdaqibit-2025-02-02/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-02-02T13:09:05+00:00"
    },
    {
        "title": "Promising Real Estate Stocks To Research - February 02nd",
        "description": "iShares Bitcoin Trust, JPMorgan Chase & Co., and Bank of America are the three Real Estate stocks to watch today, according to MarketBeat's stock screener tool. Real estate stocks are publicly traded companies that own, operate, or finance real estate properties. These stocks provide investors with",
        "url": "https://www.marketbeat.com/instant-alerts/promising-real-estate-stocks-to-research-february-02nd-2025-02-02/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-02-02T21:07:40+00:00"
    }
]