[
    {
        "title": "2 crypto investors charged with kidnapping man to get his bitcoin say video shows victim ‘laughing and smiling’ as he moves about Manhattan freely",
        "description": "“The story that he is selling doesn’t make sense,” one of their lawyers said in Manhattan criminal court as the defendants were formally arraigned.",
        "url": "https://fortune.com/crypto/2025/06/12/2-crypto-investors-kidnap-bitcoin-video-victim-laughing-manhattan/",
        "source": {
            "name": "Fortune"
        },
        "published_at": "2025-06-12T10:21:48+00:00"
    },
    {
        "title": "Photos show accuser in NYC crypto kidnapping leaving house freely, defense lawyers say (World)",
        "description": "A man who says he was kidnapped by two crypto investors for his Bitcoin was seen in photos and videos 'laughing and smiling' and moving about Manhattan freely during the days he claimed he was tortured in captivity, lawyers for the two suspects said in court Wednesday. William Duplessie, 32, and Joh...",
        "url": "https://www.castanet.net/news/World/555773/Photos-show-accuser-in-NYC-crypto-kidnapping-leaving-house-freely-defense-lawyers-say",
        "source": {
            "name": "Castanet"
        },
        "published_at": "2025-06-12T01:17:00+00:00"
    },
    {
        "title": "Bitcoin Fails to Consolidate Above $110K",
        "description": "Market Picture The crypto market has lost 1.6% of its capitalisation over the past 24 hours to $3.39 trillion. Technically, this is a retreat from previous highs, which provided resistance. The sell-off was triggered by pressure on risky assets due to renewed tensions in the Middle East. However, this should be seen as a temporary [&#8230;]The post Bitcoin Fails to Consolidate Above $110K appeared first on Action Forex.",
        "url": "https://www.actionforex.com/contributors/fundamental-analysis/600539-bitcoin-fails-to-consolidate-above-110k/",
        "source": {
            "name": "actionforex"
        },
        "published_at": "2025-06-12T10:59:14+00:00"
    }
]