[
    {
        "title": "UK proposes compensation scheme for victims of China bitcoin fraud",
        "description": "Crypto haul is at the centre of a High Court battle over a seizure of bitcoin now valued at £5bn",
        "url": "https://www.ft.com/content/127bf005-584f-47f2-98eb-a3aad8e57273",
        "source": {
            "name": "Financial Times"
        },
        "published_at": "2025-10-15T17:56:40+00:00"
    },
    {
        "title": "Polkadot Surges 3.15% as Blockchain Interoperability Gains Traction in 2025",
        "description": "On October 15, 2025, Polkadot (DOT) has been in a fairly stable situation in a comparatively peaceful cryptocurrency context, reporting a 3.15% gain in the last 24 hours. This surge is occurring as the overall crypto market is stable, with key holdings such as Bitcoin and Ethereum experiencing slight volatility. The performance of Polkadot reflects [&#8230;]The post Polkadot Surges 3.15% as Blockchain Interoperability Gains Traction in 2025 appeared first on ABC Money.",
        "url": "https://www.abcmoney.co.uk/2025/10/polkadot-surges-3-15-as-blockchain-interoperability-gains-traction-in-2025/",
        "source": {
            "name": "ABC Money"
        },
        "published_at": "2025-10-15T05:46:53+00:00"
    },
    {
        "title": "Brit is charged with founding huge crypto scam involving forced labour camps, with cops seizing £10.5 BILLION in bitcoin and freezing assets including 19 London properties, one of which is valued £100m",
        "description": "A British man has had more than £10.5 billion in bitcoin seized after he was charged with allegedly engaging in a massive crypto scam which saw the businessman use forced labour camps.",
        "url": "https://www.dailymail.co.uk/news/article-15193481/Brit-charged-crypto-scam-forced-labour-camps-bitcoin-freezing-assets.html?ns_mchannel=rss&ito=1490&ns_campaign=1490",
        "source": {
            "name": "dailymail"
        },
        "published_at": "2025-10-15T08:08:37+00:00"
    },
    {
        "title": "Top 2 cryptos analysts predict could outperform ETH and SOL this quarter",
        "description": "Ethereum (ETH) and Solana (SOL) have dominated the smart contract and DeFi markets for years. Yet, analysts now spotlight two different plays that might outperform them this quarter: Bitcoin (BTC) and Mutuum Finance (MUTM). While BTC anchors the market with its stability, Mutuum Finance (MUTM) brings a fresh DeFi structure designed to generate real on-chain [&#8230;]",
        "url": "https://cyprus-mail.com/2025/10/15/top-2-cryptos-analysts-predict-could-outperform-eth-and-sol-this-quarter",
        "source": {
            "name": "cyprus-mail"
        },
        "published_at": "2025-10-15T15:10:00+00:00"
    }
]