[
    {
        "title": "Montana House advances Bitcoin as reserve asset bill",
        "description": "Montana House advances Bitcoin as reserve asset bill",
        "url": "https://www.investing.com/news/cryptocurrency-news/montana-house-advances-bitcoin-as-reserve-asset-bill-93CH-3879505",
        "source": {
            "name": "Investing.com | Stock Market Quotes &amp; Financial News"
        },
        "published_at": "2025-02-20T10:22:07+00:00"
    },
    {
        "title": "Coinremitter Introduces the “Pricing Widget” Feature, Simplifying Crypto Payment Integration for Businesses",
        "description": "Coinremitter, one of the most popular crypto payment solutions introduced a new feature, focusing on the widespread crypto payment adoption. This solution empowers business owners to accept payments in crypto effortlessly, without requiring any coding expertise. The new Pricing Widget allows businesses to display product or service pricing plans directly on their websites, enabling customers [&#8230;]The post Coinremitter Introduces the “Pricing Widget” Feature, Simplifying Crypto Payment Integration for Businesses appeared first on ABC Money.",
        "url": "https://www.abcmoney.co.uk/2025/02/coinremitter-introduces-the-pricing-widget-feature-simplifying-crypto-payment-integration-for-businesses/",
        "source": {
            "name": "ABC Money"
        },
        "published_at": "2025-02-20T16:32:14+00:00"
    },
    {
        "title": "Hackers pose as employers to steal crypto, login credentials",
        "description": "Since early 2024, ESET researchers have been tracking DeceptiveDevelopment, a series of malicious campaigns linked to North Korea-aligned operators. Disguising themselves as software development recruiters, these threat actors lure victims with fake job offers and deliver software projects embedded with infostealing malware. “As part of a fake job interview process, the DeceptiveDevelopment operators ask their targets to take a coding test, such as adding a feature to an existing project, with the files necessary for &#8230; More &#8594;The post Hackers pose as employers to steal crypto...",
        "url": "https://www.helpnetsecurity.com/2025/02/20/deceptivedevelopment-fake-job-offers/",
        "source": {
            "name": "net-security"
        },
        "published_at": "2025-02-20T10:00:12+00:00"
    },
    {
        "title": "Sanctuary Advisors LLC Acquires 73,250 Shares of iShares Bitcoin Trust (NASDAQ:IBIT)",
        "description": "Sanctuary Advisors LLC increased its holdings in iShares Bitcoin Trust (NASDAQ:IBIT - Free Report) by 82.5% during the fourth quarter, according to the company in its most recent 13F filing with the Securities &amp; Exchange Commission. The firm owned 162,061 shares of the company's stock after pur",
        "url": "https://www.marketbeat.com/instant-alerts/sanctuary-advisors-llc-acquires-73250-shares-of-ishares-bitcoin-trust-nasdaqibit-2025-02-20/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-02-20T09:03:08+00:00"
    },
    {
        "title": "DAPP: Bitcoin Wobbles Under $100,000, Key Crypto Miner Earnings On Tap",
        "description": "DAPP: Bitcoin Wobbles Under $100,000, Key Crypto Miner Earnings On Tap",
        "url": "https://seekingalpha.com/article/4759960-dapp-bitcoin-wobbles-under-100000-key-crypto-miner-earnings-on-tap?source=feed_all_articles",
        "source": {
            "name": "Seeking Alpha"
        },
        "published_at": "2025-02-20T09:48:44+00:00"
    }
]