[
    {
        "title": "India must not shy away from crypto regulations: CoinDCX CEO says",
        "description": "Over 90 per cent of domestic crypto transaction volumes shifted offshore, roughly around Rs ₹6 lakh crore.",
        "url": "https://www.thehindubusinessline.com/money-and-banking/india-must-not-shy-away-from-crypto-regulations-coindcx-ceo-says/article69100847.ece",
        "source": {
            "name": "Business Line"
        },
        "published_at": "2025-01-16T04:21:38+00:00"
    },
    {
        "title": "Capital Investment Advisors LLC Invests $371,000 in iShares Bitcoin Trust (NASDAQ:IBIT)",
        "description": "Capital Investment Advisors LLC acquired a new position in shares of iShares Bitcoin Trust (NASDAQ:IBIT - Free Report) in the 4th quarter, according to the company in its most recent 13F filing with the SEC. The fund acquired 6,992 shares of the company's stock, valued at approximately $371,000. Se",
        "url": "https://www.marketbeat.com/instant-alerts/capital-investment-advisors-llc-invests-371000-in-ishares-bitcoin-trust-nasdaqibit-2025-01-16/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-01-16T08:23:05+00:00"
    },
    {
        "title": "North Korea stole $659 million in crypto assets last year, the US says",
        "description": "The United States, Japan and South Korea have issued a warning against North Korean threat actors, who are actively and aggressively targeting the cryptocurrency industry. In their joint advisory, the countries said threat actor groups affiliated with the Democratic People&#39;s Republic of Korea (DPRK) continue to stage numerous cybercrime campaigns to steal cryptocurrency. Those bad actors — including the Lazarus hacking group, which the US believes has been deploying cyber attacks all over the world since 2009 — target \"exchanges, digital asset custodians and individual users.\" And...",
        "url": "https://www.engadget.com/cybersecurity/north-korea-stole-659-million-in-crypto-assets-last-year-the-us-says-133029741.html?src=rss",
        "source": {
            "name": "Engadget"
        },
        "published_at": "2025-01-15T13:30:29+00:00"
    }
]