[
    {
        "title": "Strategies for college students to enhance financial flexibility",
        "description": "College life presents a myriad of financial challenges, from tuition fees to daily expenses. As students seek innovative ways to manage their finances, cryptocurrency emerges as a compelling option. Understanding how to integrate crypto into your budget can offer both flexibility and financial growth. In this context, exploring how to buy bitcoin in CAD can be a...The post Strategies for college students to enhance financial flexibility appeared first on The Rocky Mountain Collegian.",
        "url": "https://collegian.com/sponsored/2025/05/strategies-for-college-students-to-enhance-financial-flexibility/",
        "source": {
            "name": "collegian"
        },
        "published_at": "2025-05-21T15:30:30+00:00"
    },
    {
        "title": "Bitcoin Hits All-Time High Of Over $109K Amid Crypto Rally",
        "description": "The Senate advanced regulations for stablecoins earlier this week, following support from the broader crypto industry.",
        "url": "https://www.forbes.com/sites/tylerroush/2025/05/21/bitcoin-hits-all-time-high-of-over-109k-amid-crypto-rally/",
        "source": {
            "name": "Forbes"
        },
        "published_at": "2025-05-21T15:45:04+00:00"
    },
    {
        "title": "Bitcoin hits new price highs as crypto industry scores wins",
        "description": "Bitcoin hit a new all-time high as the world’s most popular cryptocurrency reached price levels not seen since President Donald Trump’s inauguration",
        "url": "https://www.marketbeat.com/articles/bitcoin-hits-new-price-highs-as-crypto-industry-scores-wins-2025-05-21/",
        "source": {
            "name": "lulegacy"
        },
        "published_at": "2025-05-21T15:45:14+00:00"
    },
    {
        "title": "Bitcoin hits new price highs as crypto industry scores wins",
        "description": "By Alan Suderman Bitcoin hit a new all-time high as the world&#8217;s most popular cryptocurrency reached price levels not seen since President Donald Trump&#8217;s inauguration. The digital asset traded above $109,400 Wednesday morning, a huge increase from recent lows of about $75,000 last month. Several other cryptocurrencies have seen similar large gains in recent days. [&#8230;]",
        "url": "https://winnipegsun.com/pmn/bitcoin-hits-new-price-highs-as-crypto-industry-scores-wins",
        "source": {
            "name": "winnipegsun"
        },
        "published_at": "2025-05-21T15:48:42+00:00"
    },
    {
        "title": "Bitcoin hits new price highs as crypto industry scores wins",
        "description": "Bitcoin hit a new all-time high as the world’s most popular cryptocurrency reached price levels not seen since President Donald Trump’s inauguration. The digital asset traded above $109,400 Wednesday morning, a huge increase from recent lows of about $75,000 last month. Several other cryptocurrencies have seen similar large gains in recent days. That includes Trump’s official meme coins, which have jumped up about 75% in the last month. Bitcoin’s price increase comes after the crypto industry scored a major win with the U.S. Senate advancing legislation that creates a federal framework...",
        "url": "https://www.mymotherlode.com/news/national/3908272/bitcoin-hits-new-price-highs-as-crypto-industry-scores-wins.html",
        "source": {
            "name": "mymotherlode"
        },
        "published_at": "2025-05-21T16:04:14+00:00"
    }
]